[
    {
        "reviewId": "gp:AOqpTOHErFx_MVjo_eoVBGaAc_990vsoWiPzJfQkEHBO-uvfMnME3RIiCNNaIUICzbsZHbcVXgJyp_SV91OHuw",
        "userName": "Fahad Humayun",
        "userImage": "https://play-lh.googleusercontent.com/-FjwGji0puK8/AAAAAAAAAAI/AAAAAAAAgi0/AMZuucmykN_wiDGsXdrRZq24inr1pRCIBQ/photo.jpg",
        "content": "I arrived in Canada on 26th August. As per my arrival date, today (i.e. 9th September) is my 14th day of self isolation. But the ArriveCan notification mentions today's reporting as 'Day 12' which is incorrect. Request to please help in correcting the days in the notifications. Thank you.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/09/2020, 11:26:26",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFwZj6JlRTuGW8njQKbcENuXgmXQ6vh8b4vyFwbE9mZhhOmaqncGmecJZ_-hYTZNihGHU97UQEbOwv80Q",
        "userName": "soobia ahmed",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjgZlTfhFcvhqj9pTS7SVbqBX2ZrQQCl9moH8jqvg",
        "content": "This app needs major improvement. Yes, it saves time from filling out another form. However, please note that at the airport, you need to save/show the code it generates after you have submitted your details. The customs officers need to see and log the code from this app. So make sure u take a screenshot of it. Other than that, we are requested to update our symptoms daily but the app doesn't allow to 'submit' the response. The 'next' button is always inactive so it's really useless.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/09/2020, 11:07:40",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFcnGqClu6_PUJUJjda2lNQYbpyClw7Eft1NBry_2zuNiSoRHLu-yOdYXzzzRzHBOxfe8uXmosxZfNXoQ",
        "userName": "Carol Grindlay",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhfclAEQ3gFnrntjoNzaCrzNa4PY-6s3r1YULI9",
        "content": "I planned my trip a month in advance but the app wouldn't allow me to enter the info until 2 weeks before my trip. Then the border officials at the border crossing I used had no interest in seeing this information. They instead wanted to see the paper that i had typed up with the same information. When I got to day 10 of quarantine the app started opening with a completely black screen so I could no longer record my symptom check in.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "09/09/2020, 10:02:59",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFyIAONJdqPCfEf36M8sFip3l0vR45SDdkXQ9IU-6_QJWLBLWRf68GqkRx5cEMU2etl-GvdG2yZLU4lew",
        "userName": "Safia Tasnim",
        "userImage": "https://play-lh.googleusercontent.com/-BeHvPGmV66A/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclcAnC2Q6bNUk9Fhw9ltsI3it6T_Q/photo.jpg",
        "content": "Me and my partner indicated that we have an appropriate accommodation for quarantine but after filling everything out they gave us our entry codes with a notice saying \"No accommodation for quarantine\"... This is quite stressful...",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/08/2020, 20:28:53",
        "replyContent": "Hi Safia. We are very sorry for the inconvenience. Our team is working to resolve this issue as soon as possible. If you continue to experience difficulties, please know that you will be provided the option at the border to fill out the paper version of the form. Please reach out if you have any questions or concerns, phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "09/09/2020, 09:36:51"
    },
    {
        "reviewId": "gp:AOqpTOH4joGdRZbuQKeF888S3CLM9wL9U-Nfz56-CRcsXU02mKLd-Yayr-ofjCCtXGdEtBYMeFEUEuSldAt2zg",
        "userName": "Mariam Lami",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhT7koRSMzVTZoiC0qd4Q12TkWLNnhurv_8vySBAXU",
        "content": "I'm glad this App is available but it doesn't fully work. We were able to submit our arrival information without issue and we were able to update it as it changed. But, we haven't been able to report symptoms as per email requests on either the app or the web app for the last 5 days now. Nothing shows up when bell is clicked. We can only redo the arrival information (which asks about symptoms but we can't select arrival earlier than 48hrs) and the quarantine location info on the web app.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/08/2020, 14:54:06",
        "replyContent": "Hello, to report your symptoms you can click the small bell icon in the top right corner of the app. Also note that symptom reporting post border is voluntary at this time. Please email us at phac.arrivecan.aspc@canada.ca with your contact information so that we can investigate further. Thank you so much!",
        "repliedAt": "09/09/2020, 09:43:23"
    },
    {
        "reviewId": "gp:AOqpTOFsxB6dnDG8UJB5tBeUSHZ03mqtNFE3rBK8TLE7G1r2Bkjrl49XgD3FSc8UczKAeoLxbIgLxKm2YkQrPg",
        "userName": "Gord Spurrell",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhjhsrxXLtJJeET92LfhKiuCmRxS1sNz2f8h3ha",
        "content": "App seems to work okay however the associated arrival process is flawed. I am a pilot and use Nexus. I use Nexus to avoid standing in line-ups (well, at least one, still have 2 more lines before exit! - got to love government bureaucracy), however if using the app, you are required to stand in the line (which normally I get to bypass using Nexus) to get a 3 digit code of the day to show the officer at the 2nd line-up. Very redundant as the app shows that it has registered your arrival and gives a code. Not worth it! I will just continue to fill out the form and hand it in at the 2nd line-up.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/08/2020, 10:38:36",
        "replyContent": "Hello! We sincerely apologize for the inconvenience. This feedback is very useful and we will certainly discuss ways to address this. Apologies again and please don't hesitate to reach out to us at phac.arrivecan.aspc@canada.ca if you have any more questions or concerns.",
        "repliedAt": "09/09/2020, 09:23:32"
    },
    {
        "reviewId": "gp:AOqpTOHU0-RyXV7ir8GIwBq_cLa7ve6CKbLvaBR2LY72_f0qtoH7RZAlyEa9edryJx17cf_NeetsVsUj_05T8g",
        "userName": "Wilbert Martin",
        "userImage": "https://play-lh.googleusercontent.com/-XP2bxrHce80/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucl45oqeI_slpcuVyDAedsgddbk6BA/photo.jpg",
        "content": "The app says passwords must include a numeric digit but numeric digits are rejected by the app? I cannot create an account?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/07/2020, 22:58:32",
        "replyContent": "Can you give us more information at phac.arrivecan.aspc@canada.ca so that we can investigate.? Please provide us with the make of your mobile device, and version of the app.",
        "repliedAt": "09/08/2020, 14:54:00"
    },
    {
        "reviewId": "gp:AOqpTOHq7_3TPuokDwaMAuLsG4REYrOwlsnQRbfl0ZMwx4_vYIvpo5hix0eQBESEX6gZqtJme0e7luqgc75eRw",
        "userName": "Paula Hanebach",
        "userImage": "https://play-lh.googleusercontent.com/-0tnvn6ocgRY/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmCMU4BXoDRftdGFV40f3zh8VQCvQ/photo.jpg",
        "content": "The ArriveCAN app is very user friendly and convenient (saves having to fill out the paper form). However I had to fill out my information three times because it kept glitching and not keeping my information and/or code. This is stressful because you begin to worry that the app isn't going to work. Once the glitches are worked out the app overall would be good",
        "score": 3,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/07/2020, 21:59:38",
        "replyContent": "Hello! Thank you for your feedback. We are truly sorry for the inconvenience. Our team is aware of this issue and working to address it as soon as possible so that users can have a smooth experience with the app. If you have time, please send us an email at phac.arrivecan.aspc@canada.ca with some details about where the app glitched during use.",
        "repliedAt": "09/09/2020, 09:15:15"
    },
    {
        "reviewId": "gp:AOqpTOHYCfZ_ruJTHHCAXyf7fWhorfychRdhG1t1E3PpBcbuFgEbaVWGhyMAL4m1wQJ6UJEECuX8CqIOZrOOEg",
        "userName": "Ashley Kizlyk",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiS5iWiyMRJli0RamGXiwd3FayXQDpW0PPAMIi2-A",
        "content": "Speeds up the process for sure but only when it works. Often doesn't open just shows a black screen and their top banner. Had to uninstall and reinstall. Now it won't let me go to the form to set my arrival, just directs me up the info pages that connect to external website pages. If y'all need some developer help, I know a good group of people. This is an important app and shouldn't be so glitchy. Ya just uninstalled and reinstalled again, form application doesn't show up. Boo. Fix it!",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/07/2020, 18:00:05",
        "replyContent": "That doesn't sound right! Can you give us more information at phac.arrivecan.aspc@canada.ca so that we can investigate.",
        "repliedAt": "09/08/2020, 14:52:13"
    },
    {
        "reviewId": "gp:AOqpTOGc2Jgoa118mPHE8ULqs7eZ0qvRQylo_LZbCCakajUZDD25JYbyf2cmzBU6ZOhFTciFxowjQ30lCyvPqw",
        "userName": "Princess Egwu",
        "userImage": "https://play-lh.googleusercontent.com/-mIbOTaqIpWI/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmFDUx8fAFInA_pBe8jXddw_JX1kg/photo.jpg",
        "content": "Nice, but in the exempt travel, there is no option for students. Some students traveling to Canada are also exempt from travel restrictions like those who have lab courses and so on. Please fix it.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/07/2020, 17:56:54",
        "replyContent": "Hello, students are not exempt from the 14 day quarantine. Therefore, you should select NO when answering the question if your travel is exempt. Any further questions, please email us at phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "09/08/2020, 17:36:32"
    },
    {
        "reviewId": "gp:AOqpTOFzDvCKSvib6crtEYx6Mw3g6d8EHNr9gSmIJ55BfgcQJvCXD_pebKKoe68rcYR8wbZdFVI4wbb5V0Y2FA",
        "userName": "job stuff",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgA8VLToGMMvH_VjEpPTphdvaB4IAfEY_zHl6dp",
        "content": "I have filled all required info and received token. Now whenever I'm trying to enter quarantine daily report I don't have the option. The top right corner bell opens blank page. On the airplane I've filled the form that was collected at my entry point. The immigration officer advise about the app so I've installed on my phone but no reporting option available. WHY?",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/07/2020, 17:04:24",
        "replyContent": "You should receive a push-notification on the app that leads you to the symptom self-assessment function, usually between 24-48 hours after arrival. You can also visit https://arrivecan.cbsa-asfc.cloud-nuage.canada.ca or call 1-833-641-0343 to report symptoms. Please note, symptom reporting is still voluntary at this time.",
        "repliedAt": "09/08/2020, 14:42:08"
    },
    {
        "reviewId": "gp:AOqpTOECSW5k7Scfk9TmFL58Z4j3HiFcAWWrO8KnTqoeEbUfzEM2kFkK3hv7GKKljHmSj_vjyr9rNL8DJt8y2Q",
        "userName": "ian pickell",
        "userImage": "https://lh3.googleusercontent.com/-j8hX6soNfSc/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckITMNuMgGaAnFn1TpNM9cLUyyHug/photo.jpg",
        "content": "Did all. Needed to change arrival time and lost most info",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "09/07/2020, 09:55:22",
        "replyContent": "Hello! We are working to improve editing capabilities in the app. We sincerely apologize for the inconvenience and we really appreciate your feedback. Please rest assured that your new information with your new arrival time will be saved. All the best.",
        "repliedAt": "09/09/2020, 09:08:57"
    },
    {
        "reviewId": "gp:AOqpTOH_nDk48oq_g3ztekmjRFGsRzy2M0-B9CP9iW64T7QItFl0o9_vKnv46xsZU8AomwcLh2vozCLYL8UBng",
        "userName": "AD Singh",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gg6Y9x324GC3meyPpm00OpodpvAbsTG9yY_SN0",
        "content": "The app is perfect. But I'm assuming that a returning permanent resident needs to select answer NO under are you exempt from travelling. Also I didn't get the option of e token number as seen on various videos on youtube... Hope it's correct what I have done",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/07/2020, 02:54:38",
        "replyContent": "Hello! The question regarding exemption is not in reference to being exempt from travelling, it is in reference to being exempt from the 14 day quarantine. As a returning permanent resident you would respond NO you are not exempt from quarantine. Also, there is no longer a need for the token - this was required for an older version of the app.",
        "repliedAt": "09/08/2020, 13:45:48"
    },
    {
        "reviewId": "gp:AOqpTOELyLDbk9bxo86JROy9E8hYpSqfP-wB-mYxDIo45RkFGabldCHYmRIcUokvVVaFBGQ6xLCPb-emkZyVyQ",
        "userName": "Aaron Rodericks",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GisNWUq19o8h5f9EHUUiNmfD30Jk7TnFAo0Ul9kBg",
        "content": "This app is HORRIFICALLY bad. 1) no real instructions in the app on how to fill it out 2) buggy and no ability to edit. My partner filled it out and it said incorrectly that there was no place to quarantine/no food available 3) there is no check in process in the app, or perhaps it's just broken. Forcing you to do daily check-ins on the phone. For something that comes with significant monetary costs for failure to comply... You needed to do A LOT better.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/06/2020, 19:30:29",
        "replyContent": "Our development is currently working to fix this issue. At this time we are advising users to re-submit their form paying close attention to the wording of the buttons rather than the color of them. You can resubmit the form as many times as you would like.",
        "repliedAt": "09/08/2020, 13:40:43"
    },
    {
        "reviewId": "gp:AOqpTOFaBB80IV62w7PZVHxrcb11bmAgcbCF0lEniYHmOlcugqAwNHBw1pZqz8QfBR_bQl9Q6_GdoaViBMsXtg",
        "userName": "H. Verschoor",
        "userImage": "https://play-lh.googleusercontent.com/-zUL857a9sew/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclfHqolxeAtftdu3GtBhwZY4V_QLg/photo.jpg",
        "content": "Although I checked in within 48 hours of arrival, I was not able to get the correct date in. No other option then to skip the app and make the phone call",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/05/2020, 16:58:44",
        "replyContent": "Hello. We are sincerely sorry for the inconvenience. If you can send us an email at phac.arrivecan.aspc@canada.ca with a screenshot of what you are seeing in the app, that will help us identify a solution for you. Thank you.",
        "repliedAt": "09/09/2020, 08:56:21"
    },
    {
        "reviewId": "gp:AOqpTOE47XPMBzJQeqZfhETqql1nwbs-tlH3MNQDvyb5kKIPDPoWkH1biWStm1Km4aiSq1Y5yFn7uAHPVjrmBw",
        "userName": "Harjinder Singh",
        "userImage": "https://lh3.googleusercontent.com/-LAcVA2dbbJ8/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclvxQ83LpYpA_zjYcc6FADO2YaRSQ/photo.jpg",
        "content": "Excellent",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.3",
        "at": "09/05/2020, 13:30:59",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOECDjTofMzzBDSedFV6ZZtakLZ_1IJwjZ7SxEsaQuaJRZA-AIoaCAiHAMc7-PW0SPFEQcbYb9ZmctNomg",
        "userName": "Harald Aa",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjlphDEV1TELH-f7GjCr5df17_Z5HAmCQIcUnPpnZc",
        "content": "Doesn't work. When putting in appropriate information about accommodation and travel the app flags it as not having any available accommodation and travel from airport. No one working at Pearson uses the app anyways so it feels like it's just for data collection. The app also flags that you are sick when answering 'no symptoms' in the symptoms check-in. You had one job guys!",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "09/05/2020, 12:06:13",
        "replyContent": "We apologize for the inconvenience. This is a new tech-related issue we are currently working to address.",
        "repliedAt": "09/08/2020, 13:05:12"
    },
    {
        "reviewId": "gp:AOqpTOF2xxbIzDutwUb14YKtdaW5HwSSq6f3bkX3dEKF5tOXjw9ksNlu6XRPi0kaD9hzJiM1_aBzuH6tEi4G0Q",
        "userName": "Mohamad Taha",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhBQ_B92c-gxW1eYwgsWP1U1Lf6SYAzfObR2zOH",
        "content": "After completing my \"profile\" - it changed the time of my flight on its own (I assume that the app used my current time zone then converted it? But now my info is incorrect on my submission). Then, after I submitted it, it said it was ok (green check-mark), but when I went back a few seconds later, it changed to red and said I didn't have accomodation or food delivery (which I do!!). Also I had to disconnect my internet in order to open the app (the app kept giving me a black screen)",
        "score": 2,
        "thumbsUpCount": 5,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/05/2020, 00:33:44",
        "replyContent": "If you need to update the information on your form prior to arriving at the border you can fill out a new form and we will accept the most recent version. If the application is indicating that you do not have accommodations or food delivery available to you when you do, this is a tech issue we are currently working to correct.",
        "repliedAt": "09/08/2020, 12:52:37"
    },
    {
        "reviewId": "gp:AOqpTOGKW1j29uYufNqoyVhPFBWjFMopkiHOMkihHw9r3TkavOcKoCxkeNmPuF5Yga_OIfIMbjcaQBNhp_Eing",
        "userName": "lol lol",
        "userImage": "https://lh3.googleusercontent.com/-TnfLRuxnT4I/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckZYTEuu7OLcVLtUP5Zue3evaudLg/photo.jpg",
        "content": "When you send me a verification code, I expect it to work.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/04/2020, 03:09:44",
        "replyContent": "Hello, if your verification code is not working, please send us an email at phac.arrivecan.aspc@canada.ca and we can investigate the issue.",
        "repliedAt": "09/08/2020, 12:42:45"
    },
    {
        "reviewId": "gp:AOqpTOEXetM32s8opYWmuwFfT6ZnuhYadFGMDbctzlMf3S2_uPATl3VbLFkbsc2Og1o5Tk40E-0VtzZiWDPe-Q",
        "userName": "Aditya Gupta",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjdYNl6t5wOpFIJkxAZTnRjF-UIGhuj3ZCAeliBMUw",
        "content": "I'm daily updates, I've been filling, No I don't have symptoms and I got an email saying, as someone who have symptoms, please be careful.. etc etc.. and that someone will call me. What stupid UI. Also- no need to use this app.. they give you a form in the flight which you have to fill. The dates are also wrong in this app.",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/02/2020, 10:22:23",
        "replyContent": "Hello, thank you for taking the time to review the app.  Feedback such as this helps us improve the user experience going forward.",
        "repliedAt": "09/02/2020, 15:49:31"
    },
    {
        "reviewId": "gp:AOqpTOFZfBOQI2YcpoAc_uR6RIxkKVakHh3DlHfUm-bawfOFHfyOGUI_zz7qqOAbKtgqkwtOAjKbm8MWh1ydtw",
        "userName": "P S",
        "userImage": "https://play-lh.googleusercontent.com/-iqaA1qnwss8/AAAAAAAAAAI/AAAAAAAAGqo/AMZuucnLEmcWsSjhpEpcEAYqbZQe2dYCXw/photo.jpg",
        "content": "I arrived on 27th of Aug with my family in Canada. As per the arrival date today is my 6th day of self isolation. But the ArriveCan notification mentions today's reporting as 4th day which is incorrect. Also after filling up the daily symptom form and submitting the button the message appears that you may have symptoms of covid even if it is submitted as NO in answers. This message should be corrected. So I started reporting telephonically to avoid this discrepancy.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/02/2020, 08:47:39",
        "replyContent": "Hello, thank you for taking the time to provide us feedback.  We have addressed this with our development team and hope to have it resolved soon.",
        "repliedAt": "09/02/2020, 15:47:36"
    },
    {
        "reviewId": "gp:AOqpTOF4pczSyWWLV4KQKuU1CCavWR5q1lHmf775a0nk_rOsYCqQ-ILylBdVRIgsBGJHbdiTJv-btU_ncFJGUw",
        "userName": "Gagandeep Singh sran",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjrHNbyLX3wkGqqUr_bdErM0ErCr-oMjPoKQkv-tQ",
        "content": "Easy. Quick.",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/02/2020, 01:00:36",
        "replyContent": "Thank you so much for your feedback! We really appreciate it. All the best.",
        "repliedAt": "09/02/2020, 08:58:57"
    },
    {
        "reviewId": "gp:AOqpTOH-4p89uhqjFgRUiV2b5Y-jeextfkXf9hF60g8wF7-vutxtLSLP9XcHi8YArcdOMA0seqC8710ot1wsbQ",
        "userName": "Brian Colquhoun",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Ghp0GKzqYLdE99kvwuE_TeTXEULn0yonCbmhCiWQw",
        "content": "The app has some problems. I used it to enter my details, and to confirm that I have suitable accommodation and that it is possible for me to have food/medicine delivered while I self-isolate. After submitting this information and reviewing it, my submission is highlighted in red and it claims I have neither accommodation nor the ability to have deliveries. I cannot present that to CBSA since it contains incorrect and misleading information and is not a reflection of the information I provided.",
        "score": 2,
        "thumbsUpCount": 10,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/01/2020, 17:25:24",
        "replyContent": "Hello. We are very sorry for your experience. Can you please send us an email at phac.arrivecan.aspc@canada.ca with your contact information and a screenshot of what you are seeing? We will get back to you as soon as possible. Thank you so much for your patience.",
        "repliedAt": "09/02/2020, 08:55:43"
    },
    {
        "reviewId": "gp:AOqpTOHjX3zO3ryOFmE-wenNiiCA4DWvjlpiEb2ZoIKB0MPSiYbyhys2cWgTwuJu3Gk-E_rMJkRQtmWHs8u2LQ",
        "userName": "tbmht 96",
        "userImage": "https://play-lh.googleusercontent.com/-U_5PPrLFR4g/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmg_7nxckzCa7XjLWxru8hYMRQQYw/photo.jpg",
        "content": "After entering all data and hitting Submit a circle keeps spinning for a good half hour and doesn't submit. Restarted phone and tried again but app goes into a black screen....",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/01/2020, 17:08:39",
        "replyContent": "Hello. We are sincerely sorry that you are experiencing this. Can you please log out, log back in, and then try and resubmit? If you continue to experience the same problem, please send us an email at phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "09/02/2020, 08:43:32"
    },
    {
        "reviewId": "gp:AOqpTOG1eFKeosv9nCzs6rP-fzDBOYwtmU8_-G_t5NljnXRnMSByMGzCVWPkOvZUMdVjixYIrYgmFrnkNhWR_g",
        "userName": "Ang",
        "userImage": "https://lh3.googleusercontent.com/-8ZOzi3XKjo4/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnxIya7PA2rX-C_O2VSbeDSVdFrUA/photo.jpg",
        "content": "Filled in the information as required for flight leaving tomorrow. Even though I enter that Yes, I have a place to quarantine for 14 days and yes, I am able to have food or medicine delivered if required, it flags me red and shows me as not having either of those. Guess I'll see what headache that brings me tomorrow.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/01/2020, 13:00:53",
        "replyContent": "Hi Ang,  Thank you for your feedback.  This is a issue with the app that has been flagged to our developers and will be resolved soon!",
        "repliedAt": "09/01/2020, 14:15:29"
    },
    {
        "reviewId": "gp:AOqpTOEMuwbsAwJUB9UWNdVXviRNsX4NKmWl68v2ibQrivL6OsW3VbmnYpZ96oUq-46nlbPlSd8DZXSgBFIXGA",
        "userName": "mohammed abd al aaty",
        "userImage": "https://play-lh.googleusercontent.com/-RMtUWseL9CI/AAAAAAAAAAI/AAAAAAAABmg/AMZuuclMeBQFVJ94TXpi003J5ePeveh2Bw/photo.jpg",
        "content": "nice",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "09/01/2020, 07:18:42",
        "replyContent": "Thank you! We appreciate the support and hope you had a great travel experience into Canada!",
        "repliedAt": "09/01/2020, 09:45:10"
    },
    {
        "reviewId": "gp:AOqpTOEfPuQ_Y2CmKptlirGdvYurK6a8vM9niWQbWxRrkCyrmFD_EMfH14QZZF2sBy_6gq4yXiVDxr2vpcusXQ",
        "userName": "Bah Mir",
        "userImage": "https://play-lh.googleusercontent.com/-aUU_3Va3ETw/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckeD8Nyset7l9DYrUAnYl2jXbWVBg/photo.jpg",
        "content": "After new update, my app screen gone black and doesn't display anything. update: I reinstall the app and the issue was resolved!",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "08/31/2020, 17:46:13",
        "replyContent": "Hello. We are really sorry for the trouble. Can you send us a note at phac.arrivecan.aspc@canada.ca with your contact information? From there, we can troubleshoot and get to the bottom of the issue in an efficient manner. Thank you so much.",
        "repliedAt": "08/31/2020, 11:57:06"
    },
    {
        "reviewId": "gp:AOqpTOGaQkIDl97EG--8KMqAPK47oBQYTbDi7xVUQI3M_QWfT_Zz5UMnH2y2seCsWC7Z5CZdh2DICKCDV_ls-w",
        "userName": "muhammad ali",
        "userImage": "https://play-lh.googleusercontent.com/-NsCSQfhW1ro/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmoXSJW0ktlAioUDykxKh5HbDrupA/photo.jpg",
        "content": "App keep crashing. Reinstalled it on both of my phones but issue remains the same. Please fix.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "08/31/2020, 13:34:46",
        "replyContent": "Hello. We sincerely apologize. Can you please send us an email at phac.arrivecan.aspc@canada.ca with your contact information? Once we learn more about your case, we will work to get this resolved as soon as possible. Thank you and hope to connect with you soon.",
        "repliedAt": "08/31/2020, 14:50:03"
    },
    {
        "reviewId": "gp:AOqpTOFUpmgEqgbS1FxHQGgeKHe5qjPe6lq48c1vn5wR5GTVpetGk3QR5T9u3b4nA8WNqVFSCJO4bUglhcJmIg",
        "userName": "Michael Parsons",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjDKQNLiKcn27gFdR1UhlzKUAXEkjWXp3VtPf5BjA",
        "content": "I just Uninstalled the app and downloaded it again to fix the issue.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "08/31/2020, 11:11:19",
        "replyContent": "Hi Michael. Sounds good. If you run into any more problems, please don't hesitate to reach out to us at phac.arrivecan.aspc@canada.ca. Thank you and all the best.",
        "repliedAt": "08/31/2020, 14:41:16"
    },
    {
        "reviewId": "gp:AOqpTOHz2ZaAq3nPWOtRaHuPAFfyEzrTQulvBRk9YE-RLY2WPHR1XOhEur28wRZCATlloeXPdTBB6G1DlCzwLQ",
        "userName": "Keith Higgins",
        "userImage": "https://lh3.googleusercontent.com/-94-ndEhIf8U/AAAAAAAAAAI/AAAAAAAABvc/AMZuucngge94vHFdcFfc0cjOk2bxvsN32w/photo.jpg",
        "content": "App keeps changing to a different Entry Time... I enter the details in Canadian time but the Entry Pass shows the entry as being 5 hours later in British Time. So I'm supposed to enter at 5pm but the pass shows 10pm. Can't wait for what I'm sure will be a problem regarding this during entry.... Response from developer: \"This is a bug\" FYI, no- one at the border knew about or asked to see the ArriveCan app, not sure if its a scam or just worthless.",
        "score": 1,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/29/2020, 22:17:14",
        "replyContent": "Hi Keith. We appreciate your feedback and we are actively working to resolve the issue that you raised. We are also continuously trying to improve awareness of the app at the border. Thank you.",
        "repliedAt": "08/31/2020, 11:54:53"
    },
    {
        "reviewId": "gp:AOqpTOFJMpicLuZ8a397nyZlMDDie8LpUFCzkphQ8FWRMb7NTt-ee2PyFdUyXo9zajS5kgemhJ4UzVA4pa6atQ",
        "userName": "dhruval prajapati",
        "userImage": "https://play-lh.googleusercontent.com/-zlZmprJTqtE/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclbBR4ReXWiWAR8ozX2I5RrZ9mCPg/photo.jpg",
        "content": "hello, can you help me with my issue ?! I have already an account in arrive can. but I am totally unable to logging into the account with correct email and password. I tried few time to enter in it but I don't understand why i am not able to log in into it ..",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "08/29/2020, 18:17:30",
        "replyContent": "Hello. That doesn't sound right. Can you please contact us at phac.arrivecan.aspc@canada.ca? We will investigate this further and find a solution for you. Thank you!",
        "repliedAt": "08/31/2020, 11:47:01"
    },
    {
        "reviewId": "gp:AOqpTOE7TxKQV5LniJbPUnnQi2iwGcM37JULkck2FP7N1t5HLCU-pplb2vxSOZa9UUHYU75KFwW77sX3swaRog",
        "userName": "Richelle Kinley",
        "userImage": "https://play-lh.googleusercontent.com/-hCGhsRzLvR0/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckXi7nKrObiTAMbt7kWk84otLHolQ/photo.jpg",
        "content": "Wont install. Tried 4 times.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "08/29/2020, 14:34:44",
        "replyContent": "Hi Richelle. Can you please send us an email at phac.arrivecan.aspc@canada.ca with your contact information? We will contact you to help get this resolved. Thank you so much!",
        "repliedAt": "08/31/2020, 11:43:54"
    },
    {
        "reviewId": "gp:AOqpTOGwXjLf3tjZmrz0lA8bezyKGvYFl9Zg8URatVfrST3qbyt_ywX-VluApLohP4ER80FV7d8P9YL98kGVeQ",
        "userName": "Mike Cormier",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgS6cs3eVSJNrFi9pf8Zqs_ubgD41xRWI4nZgy8fA",
        "content": "Won't load up at all",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "08/29/2020, 12:45:46",
        "replyContent": "Hi Mike. We are really sorry that this is happening. Can you please send us an email with some details about your phone and information about what part of the app isn't loading? We will work with you to find a solution. Thank you!  phac.arrivecan.aspc@canada.ca",
        "repliedAt": "08/31/2020, 11:37:58"
    },
    {
        "reviewId": "gp:AOqpTOGxAvAdVWahs52PvdwUDSm6aZySUsC5_OKUxf9noVi9304m8raiwDNby9IgUaubmJz6-VaNlAVUNmJgDA",
        "userName": "L Mak",
        "userImage": "https://play-lh.googleusercontent.com/-z4lav3u1iQY/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucns-G-WNY6Hit_2oW93onDANcPo8w/photo.jpg",
        "content": "Still no way to edit your arrival time or any other info after you submit. Poor app would expect better if its required to be accurate, but since its not ohh well they can deal with it.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.5.5",
        "at": "08/29/2020, 10:35:55",
        "replyContent": "Hello. We appreciate your feedback. We are continuously working to improve the app, and feedback like this is an extremely important part of that process.",
        "repliedAt": "08/31/2020, 11:33:47"
    },
    {
        "reviewId": "gp:AOqpTOGl3bLXu7r4TTr-MFObkocgCn9VrIDzKCRucxtXEOXPF5CqkBBjqqlA6CzWdBpWRWb_iWEHj7-H05IB2g",
        "userName": "Jessica Faulds",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Ggf8tltDnAWu8grhCpLSZQtxdCR0V8h9Vr6-d_us8I",
        "content": "Worked well for going through the border. I thought I was also supposed to use it for daily check ins, but I'm not seeing that option, so I hope I'm not missing anything.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/28/2020, 17:29:39",
        "replyContent": "Hi Jessica. You can use the app for daily symptom check-ins if you'd like. In the top right corner on the main screen of the app, there should be a bell. If you click it, you should see a notification which will take you to a page to report your symptoms. Please send us an email if you experience any issues phac.arrivecan.aspc@canada.ca. Thank you!",
        "repliedAt": "08/31/2020, 11:01:03"
    },
    {
        "reviewId": "gp:AOqpTOH4a-kHoiZ3_bQi4IhhZmcNUyJNHj1xrEWH1PtSujqPr-bvPEK06pAGcEktLTlzQXTOfsf0KmtIxpJpFA",
        "userName": "qualified unqualified",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiorajNHxL6609NCu7peNNG6MrltZOFbJ1xnNAI",
        "content": "filled out the questionnaire and still says incomplete file... also doesn't specify if it wants where you enter Canada or where your final destination will be.. I'm entering Canada in Montreal, but my final flight will be Halifax.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/28/2020, 08:02:29",
        "replyContent": "Hello! You should enter the flight information for the flight that will bring you into Canada (i.e. Montreal). However, your quarantine plan information should reflect the fact that you will be in Halifax. Please send us an email regarding the incomplete file notification at phac.arrivecan.aspc@canada.ca. Thank you and hope to hear from you soon.",
        "repliedAt": "08/28/2020, 12:35:19"
    },
    {
        "reviewId": "gp:AOqpTOFL22PxVvV_6nlQexDfCwCgFmGfOgrQH5xP4NhGjXbPt_bz4n2fnCsH0l9Wv37P-c8Twk7tK-EUgmrlZw",
        "userName": "Ricardo De La Torre",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gi66U5t57tP7Xa-ypwddVQXm6yUQNhc60qCCsujKg",
        "content": "Untenable and illogical from the government to reject the idea of providing GPS coordinates for the quarantine watch, alone in a cabin in the woods, rather than locked up in a city for fourteen days just because you guys expect me to provide a physical address with a postal code?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/27/2020, 18:41:28",
        "replyContent": "Hello. Sincere apologies. The app only collects addresses, it does not collect GPS coordinates. Please don't hesitate to reach out if you have any questions phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "08/28/2020, 12:22:41"
    },
    {
        "reviewId": "gp:AOqpTOHDMjYMqG86D7yLCF35eAHKwfZ5tGN_3HPyC_DKgOcPzGGeB9MP7f3EHMfNaiXCD9A5A0_nuFGSjyNI5w",
        "userName": "Simon Dyball",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjLdgEy8ACZu0HTB75k8HWslIiJ9f5v8lFDx5XKMA",
        "content": "My airline is not on there \"flylevel\" from Paris Orly.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/27/2020, 15:07:51",
        "replyContent": "Hi Simon. We are very sorry about this. Here is what I recommend: \n1. Use \"Other\" as the airline, 2. Enter the airline name in the field after selecting \"Other\", 3. If there is no flight number, please leave the default that appears. I hope this helps! Please don't hesitate to reach out if you have any more questions phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "08/27/2020, 16:35:54"
    },
    {
        "reviewId": "gp:AOqpTOHZUj9r6h8kOaIIBOUE3gvde80c_r8QCNK7BOn29oMrERfPYbtf_QibYkZsobAV0cmS1X3QsS0y-a0ELg",
        "userName": "Karin Ramsay",
        "userImage": "https://lh3.googleusercontent.com/-umqLT9T1CBQ/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnt1Mu3ev-RbA_mN-Uqs7zN5_T2RA/photo.jpg",
        "content": "Seriously, this is the worst. It says you can add travel partners but you can't enter information for them and then there is no way to change what was wrong. We submitted paperwork at the border to correct what was wrong but I'm getting harrased with calls for what was on the app anyways. And they are rude as hell about it too. There is no way to contact support at all either",
        "score": 1,
        "thumbsUpCount": 4,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/27/2020, 14:19:31",
        "replyContent": "Hello. We sincerely apologize. Can you please send us an email at phac.arrivecan.aspc@canada.ca? We will work with you to provide as much support as we can. Thank you so much.",
        "repliedAt": "08/27/2020, 16:29:08"
    },
    {
        "reviewId": "gp:AOqpTOHjHu9AUDxiqeJYsCI9urfxtkBGJAurDTZrnQ3mobjaC5QoLGtdFXu1vEbXZXUB442Ow3YaM3ysl9Jyaw",
        "userName": "Selim Younes",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiG1iERYM_hYfvmLWoNVjYEa0HN1l5X9L_9OVR17A",
        "content": "Doesn't deserve the low rating it has currently. Airport experience was faster and easier because of the app. Very simple to use. My only request is for them to tell us when we can uninstall it (or if we'll possibly need it days after landing)",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/27/2020, 08:58:06",
        "replyContent": "Hello.Thank you so much for your feedback! We recommend that you keep the app for 14 days after your arrival.  You can use the app to voluntarily report your symptoms during your quarantine.",
        "repliedAt": "08/27/2020, 11:10:55"
    },
    {
        "reviewId": "gp:AOqpTOFo_-W1gyDBr-9C7nJ0PCjN-p7R5aePZaP2mWsceaqWYHHH8o5UlyKHJcek90l9WaGeqP_aHCKlbfoKQw",
        "userName": "Reza Shayesteh Sadafian",
        "userImage": "https://play-lh.googleusercontent.com/-_exJmBW3xhI/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnQYRqqevDIT3Cf7Qlrhhtn9eCogg/photo.jpg",
        "content": "I am going to enter Canada based on work permit owners exemption, but this option is not on the list to select.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/26/2020, 12:03:06",
        "replyContent": "Hello! Can you send us an email at phac.arrivecan.aspc@canada.ca with some more information about your case? We will be able to explain the best options via email. Hope to connect with you soon.",
        "repliedAt": "08/26/2020, 16:55:21"
    },
    {
        "reviewId": "gp:AOqpTOGSBHDT-FweCnfcQREHzcljI0ZwgCnDK2YDxmpG2ZsO8DgoTjzzfLWmeafGz95-wxQPsDiJ_HDp-NA-iQ",
        "userName": "Akhil Mathew",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Ghmr-eBtyN07CxRN_dnE4WM1PHg3owp4Mi6X9RRRg",
        "content": "App is very useful, but its not allowing to submit day wise follow up questionaire. On reaching the page where it asks for if we have the symptoms for the people enrolled, the next button is deactivated so doesnt allow to submit. For new immigrants who mostly would come up with international roaming are still facing issues when officers try to contact them, it would be a good option to put a call feature or notification over the internet to avoid such hassles in this app.",
        "score": 3,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/26/2020, 08:38:21",
        "replyContent": "Hello! We really appreciate your feedback, thank you. Sincere apologies for the inconveniences. Can you please send us an email at phac.arrivecan.aspc@canada.ca with a screenshot of what you are seeing? This will help us identify a solution for you. Thank you so much!",
        "repliedAt": "08/26/2020, 11:03:07"
    },
    {
        "reviewId": "gp:AOqpTOFzlqkW8MM-r_ZILalvEesA2dh96OeEk5Ebychhx4gRRLGa8KLcmgnlkqM6IEgBO-y5MchNoyzVdTM6zw",
        "userName": "Michael Bebault",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjGt0P0ErS-VGdFMu3rYK1LsfWewm-3RDe9SBmY-w",
        "content": "Just filled out forms in app. Pretty easy. A suggestion is this: where I am doing my quarantine there is no phone available but internet yes. I can be reached using my cell number and internet only on WhatsApp. If there was a small box for \" additional information\" at the end of each section or at the end of questionnaire in general, that may help. I don't travel for another 10 days so can't comment to the crashes that others have experienced. Thanns",
        "score": 4,
        "thumbsUpCount": 12,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/25/2020, 13:56:12",
        "replyContent": "Hi Michael! Thank you for your feedback. Input like this can help improve the app and ensure that it is user-friendly for all. I will flag this to my team. If you have any more questions in the meantime, please send us an email at phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "08/25/2020, 16:35:22"
    },
    {
        "reviewId": "gp:AOqpTOGc9AS9DmRkV45gTdyZ7jWcd60uoWtm6C2HenDn8tcg6G6Fs5TN1gxsphCTAQqfiBFDyHlrqdEfJYPl0w",
        "userName": "David Abbott",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiZFcRjLej-9qGEB2meE-WR-WV2wdU9vhATAZeqRQ",
        "content": "Stopped working",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/25/2020, 00:50:38",
        "replyContent": "Hi David. We are very sorry to hear this. Can you please send us an email at phac.arrivecan.aspc@canada.ca with some more details about what isn't working for you? Thank you so much and hope to hear from you soon.",
        "repliedAt": "08/25/2020, 13:50:31"
    },
    {
        "reviewId": "gp:AOqpTOEkpr_ix1z0wgoZXW207JUArXCyttoqV9PLl_1sXOzQqdOR2eVTHtdVMuvGHjHwjUGR9XjSxV_mGuVPKA",
        "userName": "Ehsan Amjadian",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhBuStaRSyQ5PsvWdkWccffUpMcR0LF0cfnrIUDZA",
        "content": "So much better than a paper form. Where's my pen?",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.3",
        "at": "08/24/2020, 20:21:28",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFByeh5EVYJ52kig0nKY4GKFDgXTtDjGGBAz0cZcbf20tcyI8cjI2nG029DRlSXJMlp7Bn9oqbe83CAIQ",
        "userName": "william hunt",
        "userImage": "https://play-lh.googleusercontent.com/-9Xz87ufOBMo/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucm01KVg6zprhmrXGkeyAg8VIC8eKw/photo.jpg",
        "content": "Blank screen when I open the app. App worked fine to enter arrival details but cannot update anything",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/24/2020, 13:47:55",
        "replyContent": "That doesn't sound right! Can you send us more information at phac.arrivecan.aspc@canada.ca so that we can investigate this further? We will get back to you as soon as we can. Thank you very much.",
        "repliedAt": "08/24/2020, 14:47:51"
    },
    {
        "reviewId": "gp:AOqpTOFB1TRVf-7xsOHxdHDQpMNgCF5jMvCYokoSYrrneQ5xc9V-X_xwKJJcDeEB0yr7g0DkiGWjmL7HxvRTkA",
        "userName": "Peter Dimitrov",
        "userImage": "https://play-lh.googleusercontent.com/-dWyoX8SLsK0/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckmUqcvuRotM6rHHnqtz_700RJVFw/photo.jpg",
        "content": "Useless, can't report daily symptoms as doc given by CBSA asks me to do",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/24/2020, 13:47:35",
        "replyContent": "A new version of the app was released on Friday for both Android and iPhone devices to address this specific issue. Please try and re-download the most recent version of the app. If you continue to experience the same problem, please send us an email at phac.arrivecan.aspc@canada.ca. Thank you so much!",
        "repliedAt": "08/24/2020, 14:46:02"
    },
    {
        "reviewId": "gp:AOqpTOGfjMPhdK_w2yZm_p7FsoRTDUQGxxeBrdCOnh9Mg4igXjqtH3BI8XKOE7DlnRQ6X8aZ1Djo5tfqxgUKRQ",
        "userName": "Bruno Schwizer",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gj8o5ac9Ie0EQz1uWJeVxH8KRPJXbDA0pZKzj3FLdU",
        "content": "Doesn't even launch properly. Just opens to a black screen and gets stuck there.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/23/2020, 13:36:34",
        "replyContent": "That doesn't sound right! Can you give us more information at phac.arrivecan.aspc@canada.ca so we can investigate this further? We will get back to you as soon as possible. Thank you very much.",
        "repliedAt": "08/24/2020, 14:36:25"
    },
    {
        "reviewId": "gp:AOqpTOH59qVAoXKmrPKSVM2FqLppl-Eqb_my339xSZiYic2SCxFs4OUbQgVKqU96JfSV9wH8VboHaw2rH5V6bg",
        "userName": "S K",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gjbm9bDdP8EJ_FPt4XNjOwZufkIhJ9m2MPw5rpRwA",
        "content": "I was unable to change info when I realized I made a mistake and advanced to the next section. Also, I was unable to check in using the app and had to go through the website. Now that my quarantine is more than over, I still get CBSA spam asking me to check in and log any symptoms. My travel data was entered into the app so the system should know that my isolation is complete.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/23/2020, 10:42:17",
        "replyContent": "Hello. We are very sorry that you continue to receive emails. Please send us an email at phac.arrivecan.aspc@canada.ca and we will do our best to assist. Thank you so much.",
        "repliedAt": "08/24/2020, 14:31:53"
    },
    {
        "reviewId": "gp:AOqpTOHXgcRvs0MXFuGUJALJnzuJVQDYgOdF_6-xecWgiuTos_a4ylCtuCYAkeQ-iV2AikgQ3g_y4Asw82pe1Q",
        "userName": "Elizabeth Kwong",
        "userImage": "https://play-lh.googleusercontent.com/-VFXauAFtEz8/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnx1SLw7XbKUY5U_GNwDjieZYuDqg/photo.jpg",
        "content": "Doesn't work",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/22/2020, 03:49:31",
        "replyContent": "Hi Elizabeth. We are very sorry that you have experienced some issues with the app. Please send us an email at phac.arrivecan.aspc@canada.ca with some more details about what is not working for you. Thank you so much!",
        "repliedAt": "08/24/2020, 14:19:31"
    },
    {
        "reviewId": "gp:AOqpTOHESiGbKH71AAIymhNY2StmkuEjK0dY0PYRjXO010e4xaHQau4Jru1m-5TuyBrn5oqoFuCyZXLYB_Ol2g",
        "userName": "Selina Chan",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhbYJPnNuc1YQsBPwC_FUDvIHc-vm_LutdlSElZ5A",
        "content": "Considering no one at the border asked me for this information, the app is more or less useless.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/21/2020, 20:25:32",
        "replyContent": "Hi Selina. We sincerely apologize for this. We are actively working to enhance awareness of ArriveCan at the border. If you have time, we would greatly appreciate it if you could share your point of entry with us at phac.arrivecan.aspc@canada.ca. Thank you so much!",
        "repliedAt": "08/24/2020, 14:15:14"
    },
    {
        "reviewId": "gp:AOqpTOG2bJak1ShZHZQ9H8Mg2t6cq0sI8GDwUzCSSpSun_g8LJpp0zgFu0MQjQShW56VvcsKuTmoxG5CKmmTwA",
        "userName": "Family Olivieri",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgQsUXcBup01LDOrqEbGVk_KtpxmkIybY3P9ZziVA",
        "content": "Do not use this app. \"THEY\" will be after you....i repeat DO NOT use this app. Thank you",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/20/2020, 15:48:48",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFJDqpDapDGH_oiubNJesdNwfqHF_PTQ2qBZBLu_-ahrBebHrUvL0rSIIWVRDmLmaYkfgb2R7Ud5XOBfw",
        "userName": "Kevin Townsend",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gh_oqrVxWB5O4RW0hHHW6BxLIU3AkXGfu55KHe4RQ",
        "content": "The app worked good for getting across the border but it said I could use it to do the 48 hour check-in and daily symptoms report and there are no options for that. My notifications area is always blank.",
        "score": 4,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/19/2020, 13:26:44",
        "replyContent": "Hi Kevin. We are very sorry that you are experiencing this. Can you kindly send us an email at phac.arrivecan.aspc@canada.ca with some more information and the email address that you used to create an account? Thank you so much.",
        "repliedAt": "08/20/2020, 12:30:16"
    },
    {
        "reviewId": "gp:AOqpTOEd45QkNo1Yijo8jvnX64qRSeMdxIvXOQSDzuga44ze_vyPB3718ydfIb39bMV7HhQvZqEG6ArmK6yB4Q",
        "userName": "George Gleadall",
        "userImage": "https://lh3.googleusercontent.com/-J_QA8KJFlKg/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclcj4zzGQRZWBtRMzHwfyWzX_jS8Q/photo.jpg",
        "content": "Planned a trip in advance by car and put in all relevant details. The system did not save this information and did not tell me that. It seems that the system only issues you with an entry number on the day of arrival which is ridiculous as you would then have to stop on the road to enter the information etc again (the developers forgot that arriving by car is different to flying in). 500 words is not enough to complain about trying to log on once you have arrived to advise daily symptoms",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/17/2020, 10:31:18",
        "replyContent": "Hi George. We are very sorry that you have had a negative experience with the app. Can you please send us some more information about the type of device that you use and what went wrong? We will do our best to address the issue. Thank you so much!  You can reach us here: phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "08/17/2020, 14:24:37"
    },
    {
        "reviewId": "gp:AOqpTOHnjz3T7FlvavjxuGFTDtEnUPz6UIwd1BrBEUsj1OI7cMlxkgrTgua_PDQDikLGArx3u2t_fIvRn1S4dA",
        "userName": "Kunal Thakur",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gidl5TsOlLz_MYYYUQQZGJj3K9W4aRuRuvQom1XoA",
        "content": "I traveled back to Canada on 7 August but I am unable to update my information or do a voluntary reporting! Also, I filled in all my information through the app of my arrival, but no one at the airport (Pearson) asked for ArriveCan code, all I was asked for was a paper form. The app needs to be revamped completely.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/16/2020, 08:13:15",
        "replyContent": "Sincere apologies for the inconvenience. Please ensure that you have the latest version of the app. You should be able to update your symptoms post-border by clicking the bell icon on the Top Right corner of the main screen and then selecting the appropriate notification. Please let us know if you have more questions phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "08/17/2020, 14:18:36"
    },
    {
        "reviewId": "gp:AOqpTOGvOSMUdcSUVKYN4Ucx8E3dhe-bwxTlFxXLyHUfzOEEJ-PGsnQw5ouV58aMrHgKk35yTHp2NNXS1BQhSw",
        "userName": "1492irina",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjIZQIhLpnT3WIfszWsmNg_HEqmL1q8gQujmDBKug",
        "content": "Just a note: for airports you should list locations as well. I tried to search for \"Montreal\" in the list before I realized I had to use the airport name (\"Pierre-Elliot Trudeau airport\").",
        "score": 4,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/15/2020, 21:50:02",
        "replyContent": "Hello. Thank you for your feedback, it is greatly appreciated. This will be flagged to the appropriate team to help advise future iterations of the app.",
        "repliedAt": "08/17/2020, 11:48:29"
    },
    {
        "reviewId": "gp:AOqpTOFojGdW_heG9AUIIubH-t07Q4yasuMjz4tj3xWUtmJfLKFYHbIRtxkourhe72s9tB9VgxGz2_nraBCgfQ",
        "userName": "Steve Miller",
        "userImage": "https://play-lh.googleusercontent.com/-rTSpAon9JAM/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmq84Xcv4Cq2X-t4BzEci1Q3LdX4w/photo.jpg",
        "content": "I could not get past the 2nd question, 'Please indicate the type of Exempt travel you are performing for this trip'. It only allows me to choose from 4 exempt categories. However the Govt of Canada page provides 13 different categories. The app does not allow for 'Family reunification', which is the reason I am exempt from COVID-19 restrictions. So downloading this was really a waste of time. The app should be aligned with the official Government of Canada restriction measures & exemptions.",
        "score": 2,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/15/2020, 09:51:41",
        "replyContent": "You are exempt from COVID-19 travel restrictions in that you are allowed to travel for family reunification, but you are not exempt from the 14 day quarantine requirement. You will still be required to quarantine for 14 days and therefore should not select that you are exempt. Please let us know if you have questions! phac.arrivecan.aspc@canada.ca",
        "repliedAt": "08/17/2020, 12:07:41"
    },
    {
        "reviewId": "gp:AOqpTOFbxf8tjR0LofnARYkeXuwFEBp2vg9jYAs6V8oyN_gOto3OHkX8SCwOPCER7bSHQKgmZ2klZ6Yuahi3fg",
        "userName": "Nemo Ang",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhR4Q5kYz6vnH4s8LFVHC4YtiMcNwpvSCmxbkNR3BM",
        "content": "Why rooted devices are not allowened to use?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/13/2020, 15:25:42",
        "replyContent": "Hello! We sincerely apologize for the inconvenience. Our current security policy prevents us from allowing rooted devices to download the app. However, we are constantly in review of these policies and this restriction may change in the future. We will keep you updated if it does.",
        "repliedAt": "08/14/2020, 10:47:03"
    },
    {
        "reviewId": "gp:AOqpTOHaPv6EXRZy547tniWVYuFIikulnUudXG1oiJddxxgAIPvUcwkwqkvWXu7nlW1SNzw7KPZNtPOmKBFkjQ",
        "userName": "Tricia Jackson",
        "userImage": "https://play-lh.googleusercontent.com/-fVEFFMzgPxg/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmfQXTovOiLBx-RS9S8_aOMlHa6gQ/photo.jpg",
        "content": "The form is very straightforward and user friendly but unfortunately it will not let me complete it. I suspect this is because it is 11 days before I travel, but it is not clear. I am unsure if a hotel classes as 'group' accommodation as I will be quarantined within my room Also I am not an exempt traveller (because of my work ) but I can travel to Canada because a close relative has permanent residency, which I cannot record anywhere",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/13/2020, 12:15:42",
        "replyContent": "Hi Tricia. We are very sorry for the obstacles that you have faced while filling out the app. If you send us an email at phac.arrivecan.aspc@canada.ca we can answer your questions in more detail. Hope to connect with you soon. All the best.",
        "repliedAt": "08/13/2020, 15:23:17"
    },
    {
        "reviewId": "gp:AOqpTOFPthB4e1G_5iM7FUZz3pqN-GkMxFGEOHgeTtRUfgAZm122O6Ixxhh3dAgK49rsUj4K2K6mtiJ7CsOUAg",
        "userName": "D Hopkins",
        "userImage": "https://play-lh.googleusercontent.com/-mzGx-jKLkpM/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmPWfkO0zVDMf_5x0aeXrYj0_3ViA/photo.jpg",
        "content": "The app works for me but I cross every work day for employment purposes and I do not know what exemption category applies to me. I am not a medical worker. There is no explanation as to what the categories mean. A help or info button would be nice.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/13/2020, 11:01:13",
        "replyContent": "Hello. Thank you very much for your feedback. It is appreciated. If you could send us an email at phac.arrivecan.aspc@canada.ca with some more information about the type of work you do, this will help us with our Communications efforts for the app. Thank you so much!",
        "repliedAt": "08/13/2020, 11:26:33"
    },
    {
        "reviewId": "gp:AOqpTOFKDX18fiwyhPzPanLb9Qyaitb7EpBYTpwvo7ORsxnoVlmD49yJLBaJ4F1zB2cFauSYTVSt8g8KPd5Daw",
        "userName": "Michael The Arch Angel",
        "userImage": "https://play-lh.googleusercontent.com/-DHnTxRkDe-4/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuck51DRjCptfQclq0HEjGhr9YgFWQQ/photo.jpg",
        "content": "I've had this app on my phone for a few weeks as required. I'm in the transport industry driving expedite freight. First couple times I had to reinstall after each use. Does not save traveller info for more than a few days. I travelled on Friday back into Canada was off for a few days left on Tuesday came back on Wednesday and I had to redo all my information again. Why set up an account if it doesn't save your direct information that's in your account. Very annoying and time-consuming .",
        "score": 1,
        "thumbsUpCount": 12,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/12/2020, 22:27:24",
        "replyContent": "Hello. We sincerely apologize for the inconvenience. We greatly appreciate your feedback, and we will work to ensure that user experiences such as this are a priority in future iterations of the app. In the meantime, please ensure that you have the most recent version of the app downloaded on your phone. Thank you so much!",
        "repliedAt": "08/13/2020, 11:19:47"
    },
    {
        "reviewId": "gp:AOqpTOEA4LSsBx5DKg_JmhYWbKWfod644T1IvT1yDLNPPjE3i96Rg0S4kcyEwM5G7JPO5sUTKAVxhbCuu-WV6Q",
        "userName": "Landon D. C. Elkind",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiHpPQuWE1fPkumMu7xd5dhthdH7XZ8L53C59rMYRw",
        "content": "The application works well. However, the travel document section does not work for travellers with a child under one year old. Such persons may not have a passport, and one is unable to submit them as a traveller in this application without one. But this shouldn't be the case for persons that young, who officially do not need a passport to travel.",
        "score": 4,
        "thumbsUpCount": 5,
        "reviewCreatedVersion": "2.4.2",
        "at": "08/12/2020, 20:30:36",
        "replyContent": "Hello. Thank you very much for your feedback. It is fundamental to enhancing and improving the app. We are aware of this limitation and we are looking to address it. Since this is a mandatory field,  you unfortunately won't be able to submit on behalf of your child in advance of the border. You'll need to provide this information at the border.",
        "repliedAt": "08/13/2020, 12:08:33"
    },
    {
        "reviewId": "gp:AOqpTOFrfgkeXdi5Ri55iB9VcQu-yOIkK4z-XeCEWQLTpzBgns796n9vSrXLDUtfXa3bgWkA2NL4NdJlAEvjGA",
        "userName": "Aston Lau",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhVmZvrTdxOLhqXzUbjKyGjmQTic6NBryu7-5mPa4A",
        "content": "Once you sign up through the app, expect a barrage of daily spammy emails reminding you to submit your Quarantine and Symptoms Information prior to your arrival in Canada, even though you've already done so and your trip is over (or, in my case, never happened).",
        "score": 2,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/11/2020, 16:12:57",
        "replyContent": "Hi Aston. I am really sorry that you received numerous emails. Can you send us an email with the following information? We would like to know when you received the emails, whether you registered for the app or the website version, and the operating system that you were using at the time. You can reach us at phac.arrivecan.aspc@canada.ca. Thank you!",
        "repliedAt": "08/12/2020, 11:50:16"
    },
    {
        "reviewId": "gp:AOqpTOHW190veyqM0aKkG6-czG2SfeNwiVH6r_0sqtVj0tvAStQ3Q07J2m6PfHjfOBLii_ldYHuJPXHPCzXF6A",
        "userName": "harsh patel",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjJpN-R4OuLisjBuwqp05s_e3NbsL8bb96DL_VZ0w",
        "content": "I'm a student. I got viza before 18 march so I'm eligible for travel in Canada. In this app first step is type of except travel however, in this step dose not mentioned about students except. Please add this point also because, this app is mandatory for travel in Canada.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/10/2020, 11:47:03",
        "replyContent": "Hi Harsh. As an international student, you may be eligible for travel to Canada provided that you do not have COVID-19 symptoms. However, you are still required to quarantine for 14 days upon your arrival to Canada. As a result, selecting exempt in the app would not be appropriate, because you are not exempt from the quarantine requirement.",
        "repliedAt": "08/10/2020, 11:08:28"
    },
    {
        "reviewId": "gp:AOqpTOF9yT-Z9sC93IL5sQAUI2YirK452tZvdMHHXUF9V4ahu-ll_ZwM8FmNWJ5PKHIKHQHudvdBZ7hPXz4t5g",
        "userName": "Panktti R Mehta",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgJCgY3poitbrj3lJOGddSt4YySHm2KCVH0Lbn8Cg",
        "content": "Hi, I am not able to answer the first question being a COPR holder. My travel is exempt but which option to select out of the 4?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/10/2020, 09:51:11",
        "replyContent": "Hi Pankitti. Can you please send us an email at phac.arrivecan.aspc@canada.ca with some more information about your case? We will get back to you as soon as possible. Thank you!",
        "repliedAt": "08/10/2020, 11:11:03"
    },
    {
        "reviewId": "gp:AOqpTOHsrOaZE7chqJ1WW2nn0rrQ8gXff6ONgMmcUhx-3VYuAdh-H_UaucvLPIBEz1mYSdtN5Agwa3whiGlo5A",
        "userName": "Jonathan Carter",
        "userImage": "https://lh3.googleusercontent.com/-DhXc5kiXnsY/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnu0qVLSx2sD3k-oXnFQtMSl6XiuA/photo.jpg",
        "content": "I can only do this for the month it is? My flight in in September but it won't let me fill in information for that month. For an app as important as this, you should be able to enter your information for any date",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/10/2020, 01:03:26",
        "replyContent": "Hi Jonathan. That doesn't sound right! Can you send us an email at phac.arrivecan.aspc@canada.ca with your contact information and some more details about what is going on? We will get back to you as soon as possible.",
        "repliedAt": "08/10/2020, 11:20:06"
    },
    {
        "reviewId": "gp:AOqpTOEOiqmKCHTbRZjOF2Bw38gdlx_EL0b8Q1orPRDMLegFCInvRygkrIV0mTaYOSbPPSdB9S_Cc34_1yf4lQ",
        "userName": "Polina Ryabko",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhDkP0ViOafhfi1Cs4PUuMFFspXKK-GxMpx8gHE",
        "content": "Good app. Quick. Better than that paper",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/09/2020, 16:55:04",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOF5czP87hd2wzivxVtq6zZ4J40Sj4QV4lkmPQPLsRjnm1-NdkSd4PRbxuL-01VOKCL3ghiKcH58NqasqQ",
        "userName": "Bill Johnson",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjHxvd8LNrnkvyAzMDDmV5bpJT3a95gfxh5mfGc_qs",
        "content": "The app worked fine for me prior to entering the country by land 2020/07/31. If you truly want an accurate arrival time, the user should have the ability to change it. Although at the border, when I told them I had the ArriveCan app confirmation, they were not interested in it at all. So it was a waste of my time even dealing with the app.",
        "score": 1,
        "thumbsUpCount": 8,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/08/2020, 10:46:38",
        "replyContent": "Hi Bill. We sincerely apologize for the fact that you had a negative experience with the app. I will certainly flag this to my team. If you have time, please send us an email at phac.arrivecan.aspc@canada.ca with some more details about what went wrong, as well as the border that you arrived at.",
        "repliedAt": "08/10/2020, 10:36:11"
    },
    {
        "reviewId": "gp:AOqpTOGElnzMzu_z9H4YrAhCmYMauAYWjmu_qyIXsrqQXhN9GvYjYCMyEBb_j2ORERF0ac571t7h2p5J9WsrGg",
        "userName": "Kareem Halabi",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhZUOclU4UFCZ5llHkGFLcZzG-1xg9nbAIFBSXA7A",
        "content": "I have no idea why the reviews for this app are so negative. The app seems to be well designed and I had a painless experience filling out the form!",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/07/2020, 22:08:36",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOE2B9HPTC3mutgMZMzjUuUan2AhVcM8odtK1ceT29VU1wWjdAt_ArNjsU0-YSNp_j996tQHHhVKKJI13Q",
        "userName": "Tad Pole",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gg9woN2dtZuP83OaOyYBdEZcQ4e6jTkT0bTSAEQXQ",
        "content": "Horrible app that's useless. It worked for checking through the airport but as far as the thing 48 hours later. It doesn't work.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/07/2020, 21:48:31",
        "replyContent": "Hello. We sincerely apologize for your experience. Can you please send us an email at phac.arrivecan.aspc@canada.ca with some more details about what happened after the airport? We will do our best to assist. Thank you.",
        "repliedAt": "08/10/2020, 10:08:43"
    },
    {
        "reviewId": "gp:AOqpTOEa9Loi9vUlOBGkIUOESG9TYgNqob6xGEWqcSPaPXsSFQKXUPIS8wqAzvkLQG5zXpms0Bzn-7q9sXql0w",
        "userName": "Robert Esler",
        "userImage": "https://play-lh.googleusercontent.com/-ReQ9HErMjYo/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmkJXs1joVKRBR5hH9Tsj3qt4WVVg/photo.jpg",
        "content": "I am a US Trucker, I can't download the app on my Android. Please let me know how to get it done.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/07/2020, 21:09:01",
        "replyContent": "Hi Robert. We are sorry to hear that you are experiencing this. Can you please send us an email at phac.arrivecan.aspc@canada.ca with your contact information? We will do our best to get to the bottom of this.",
        "repliedAt": "08/10/2020, 10:04:29"
    },
    {
        "reviewId": "gp:AOqpTOHaAOoWZIKZjy3Pe5jDiYpwyzuTvLC5-XyGGhiHyhxzWWfTI797w5-JeXP6tiWxtYwvCc2CN9iWD91Gzg",
        "userName": "abu nafea mustafa",
        "userImage": "https://play-lh.googleusercontent.com/-ZdiGNNxBxPQ/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuck9PuY_ses4eXlYegt-poJ6_vtblg/photo.jpg",
        "content": "What shall be our travel exemption if my family and I are entering Canada as permanent residents?",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.3",
        "at": "08/07/2020, 20:52:05",
        "replyContent": "Hi there! Thank you for your question. Please send us an email at phac.arrivecan.aspc@canada.ca so that we can explain in more detail. Looking forward to connecting with you soon.",
        "repliedAt": "08/10/2020, 10:01:44"
    },
    {
        "reviewId": "gp:AOqpTOGnP5QpyhEncWL0dECdHWylvse3dzYyzhgnpdsv0ln6ybJLXogrxg2YlFA-Rp2v4sVLUgm-sQYxJtkXuQ",
        "userName": "HeyCulligan Man",
        "userImage": "https://play-lh.googleusercontent.com/-Ts6pr8AM2lo/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckY81vdQBXYacK7u2y8Xnf1zFJcTg/photo.jpg",
        "content": "Trying to use the ArriveCAN APP, however it does not have Houlton or Belleville as a port of entry for land based travel. I modified this review because they contacted me and informed me it is Woodstock. Traveling from Bangor Maine to Fredericton, NB for essential services",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/07/2020, 12:02:01",
        "replyContent": "Hello! We sincerely apologize for the inconvenience. The border that you are planning to cross is listed as Woodstock in the app, since Woodstock Rd. is the official name of the Canadian border. I hope this helps. I will flag your comment to our team to help advise future iterations of the app.",
        "repliedAt": "08/07/2020, 11:57:16"
    },
    {
        "reviewId": "gp:AOqpTOFncrvPgsqi1KRjuWB04-bx3u6X624RAymaGuzbggC73kM1O3N00XTQzJot65i5-MLIpRiOHteCs-DvKQ",
        "userName": "Stephen Just",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjAPlD_4lCJVK4ERJslrvTEzzWwxrX4RIjaBN5HyA",
        "content": "I've used this app for entering Canada on two occasions now, and it has improved dramatically over the months. I've started to get some emails about a health questionnaire from the government - it would be nice if the app could handle this questionnaire too.",
        "score": 4,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/07/2020, 09:36:32",
        "replyContent": "Hi Stephen! Thank you so much for your feedback, that is great to hear. I will pass along your suggestion to my team for consideration. All the best.",
        "repliedAt": "08/07/2020, 12:01:29"
    },
    {
        "reviewId": "gp:AOqpTOEQfGbCzoCgYeyAdmHDZ0Ph3QoAlM7Dd1d3xZOtfC5QcF-2P5y66dlDGL3Vmdtm5snJEcgrh-RUfH-DPw",
        "userName": "Mehri Jambakhsh",
        "userImage": "https://play-lh.googleusercontent.com/-56wz3K9ye-0/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnB5bK-0psFIrbk9GpKdkgVP5KBuw/photo.jpg",
        "content": "Good",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.6",
        "at": "08/07/2020, 08:39:54",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFjdNp0bslBPdGpTk5ge7jhSL9TbT9Icy1K9xfZjc55rPhrv5aYg42Su1xs7p6xX7BiFmmv5WUkg6GBRA",
        "userName": "Flora",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgATBlyIeHr34qcTgxgorAc922OmEY3UZBOqTabKio",
        "content": "Keep crashing",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/07/2020, 08:10:58",
        "replyContent": "Hi Flora. We are sincerely sorry that you are experiencing this. Can you please send us an email at phac.arrivecan.aspc@canada.ca with some more details about your case? Thank you so much!",
        "repliedAt": "08/07/2020, 09:35:38"
    },
    {
        "reviewId": "gp:AOqpTOEi9gA906dztaaWYE063roYJhVG8NBuqSLSZAUM9y61vSLZBtJbcfq62yOdLK8fGT3ICgJj1XciKBeI8Q",
        "userName": "Bhavin Gamit",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gi3DljXH02ywdks_QFuHrV-yKVQhJodaxa4QLBh9A",
        "content": "I missed my flight, how can I remove my old info from the app. Or should I just add the new flight details on top of that? Please let me know, I would really appreciate the response back from you.",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.3",
        "at": "08/07/2020, 06:35:37",
        "replyContent": "Hi Bhavin! Thank you for your note. You can actually just add the new travel details to the app and re-submit the form. The ArriveCan app will consider the most recent information that you submit to be the most accurate. I hope this helps!",
        "repliedAt": "08/07/2020, 09:32:24"
    },
    {
        "reviewId": "gp:AOqpTOFdJzeWr_QiGLHPy_KgNuTZk12qgnD2wx8r2GWQasUvy8f8vTwx1_-NtePXxzh-2EAnAef4MbHmqjk39g",
        "userName": "Girish Prasad",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Ghaf-n3SdZLwcFT44e_mRLsPPelGpc0HQze6_1ZHw",
        "content": "Keep crashing..i even can't open the application.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/06/2020, 17:29:52",
        "replyContent": "Hello. We are very sorry for this inconvenience. Can you kindly send us an email at phac.arrivecan.aspc@canada.ca? We will get back to you as soon as possible to assist with your case. Thank you!",
        "repliedAt": "08/07/2020, 09:39:31"
    },
    {
        "reviewId": "gp:AOqpTOG6jfQhUCNoQMMRB-LbY4iqa7YcqFLvhv2AEKOpLo_xWH4bUnY3FqqCtVpifj9uhkOIWUgyfVi02DkvXg",
        "userName": "Darko Aleksic",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiNLH7GuUzLYqFHDKk151aIaXiQFOGSY6AwtclNZEE",
        "content": "Works only for entering the country. There is no option to do the daily updates, you have to use the web app for that, and there is no link between the two. Note that this contradicts their release note but as of Aug 6,there is no app update.",
        "score": 2,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.3.3",
        "at": "08/06/2020, 09:07:01",
        "replyContent": "Hi Darko. We apologize for the difficulties that you have experienced. Thank you for your feedback, comments like these are very helpful for the implementation of future app updates. Please send us an email at phac.arrivecan.aspc@canada.ca so that we can address your concerns in more detail.",
        "repliedAt": "08/06/2020, 14:16:30"
    },
    {
        "reviewId": "gp:AOqpTOFZgyRiu3Z3WX66BG7HCD_8bGD_aLFhWxdp1a36C-deKOK_Fj_mLgGBbwtZt5oBcbT0_m1WObsDXHujrA",
        "userName": "Sarah Bougadra",
        "userImage": "https://play-lh.googleusercontent.com/-DUl0KnZJ1bM/AAAAAAAAAAI/AAAAAAAAAHE/AMZuuclBHEsU-Kmh02oB4TTKPsFGU4UHWA/photo.jpg",
        "content": "The app won't open after first installation. I uninstalled it, reinstalled again, once you exit the app it won't open again, it keeps crashing!",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/06/2020, 00:30:52",
        "replyContent": "Hi Sarah. We sincerely apologize. Can you send us an email at phac.arrivecan.aspc@canada.ca? We will work with you to identify a solution. Hope to talk to you soon.",
        "repliedAt": "08/06/2020, 11:06:26"
    },
    {
        "reviewId": "gp:AOqpTOEaj5ByveQtcPqoKtGzFOHQv5ov_iYv8HsoEixe5ElhXnrAciuZPaBOB4Cyh7iCSQYXOIkDspSG0Jdo_w",
        "userName": "Lulu Mackinnon",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgWY6wnuebDsg1KVmsOo9HocIWPBvPh195VHYLGdE0",
        "content": "Wont open crashes instead. \"Error occured\" every time I try to open the app.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.3",
        "at": "08/05/2020, 18:34:19",
        "replyContent": "Hi Lulu. We are really sorry that you are experiencing this. Please send us an email at phac.arrivecan.aspc@canada.ca and we will provide you with assistance.",
        "repliedAt": "08/06/2020, 10:28:53"
    },
    {
        "reviewId": "gp:AOqpTOEohZ3DVRA5rHkZa_kRRGqeOS4SZ8kZzaAE3kyCjw5I_s-v5Wz8ce9lK65PU_5Zq4UdVESJUsl-MGaAEQ",
        "userName": "Tanya Borsuk",
        "userImage": "https://play-lh.googleusercontent.com/-4ke1lk70_s4/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmGGiDR4mselxr1FyBurJL9haixSg/photo.jpg",
        "content": "The app keeps crashing. It worked long enough for me to input my data, but hasn't opened since.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.3",
        "at": "08/05/2020, 09:04:06",
        "replyContent": "Hi Tanya. We are truly sorry that you experienced these technical difficulties. Can you please send us an email at phac.arrivecan.aspc@canada.ca and note the email that you used to try and create an account? Thank you so much!",
        "repliedAt": "08/05/2020, 13:53:18"
    },
    {
        "reviewId": "gp:AOqpTOFdLSv3XHUpa_AyiMUwv_Ac10fKeCfzYShlRT5aEgIRpF5n-jNvN7UBBzF80UJNY2tXoKTWeJhklP68jw",
        "userName": "Tara Content",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgDfbrO3OaC6fZ2X8WKplk16W0am0lLPLKRsElW",
        "content": "Keeps closing on me. And, why can't app accept airport codes. Way faster. I uninstalled and reinstalled and it worked. Customs Canada unaware of codes that need to be inserted before you can click on enter. I was told that's a Canada Health thing they are unaware of and they don't need it. So, it doesn't seem anyone needs or knows about the 3 digit code. I take screen shot of confirmation as sometimes it closes and I do not have time to stand to the side and sign in all over again.",
        "score": 2,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/05/2020, 08:00:56",
        "replyContent": "Hi Tara. Sincere apologies again for your experience with the app. We will be following up with you directly via email. We will touch base with you soon. All the best!",
        "repliedAt": "08/05/2020, 13:45:50"
    },
    {
        "reviewId": "gp:AOqpTOGrIyRVkgayxJSNaDTYPuxY90QFMWbfEWOFBm2jOMu1XYoh7o1YBOLV7tPVBB5aXvfFn5HqpA1LOCtOEg",
        "userName": "Saad Tuama",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiBQo7EB2QpIGzXgoWmFkv-CucFn2eNJGe8tlLgdQ",
        "content": "Hi there, I am a COPR holder (approved before 18 Mar) and about to land soon in Canada, I can't find any option to select in exemption list for my case, could you please advise. Thanks",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.3.3",
        "at": "08/05/2020, 01:50:10",
        "replyContent": "Hi Saad! Thank you for reaching out! Can you please send us an email at phac.arrivecan.aspc@canada.ca? We can explain this further via email. Hope to connect with you soon!",
        "repliedAt": "08/05/2020, 13:42:46"
    },
    {
        "reviewId": "gp:AOqpTOHn6mlOMMEFFBZ_XEMWvvo1_bXK2txFKdOz7XmEhkiqdPLHTNzr3FCrHbd75Ru_LiLAmt-46V5QIhv7rg",
        "userName": "Waheed Ahmad",
        "userImage": "https://play-lh.googleusercontent.com/-lpjlqDSMV1U/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclKv6qj-jXXmSeK0T-csI5dEu88Jg/photo.jpg",
        "content": "Good",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/04/2020, 21:23:19",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOG3JDcvpJt80pVLdZ3IRVnxiHB7ysUoXybTXyb0_YPfDFGamc65SNYmioEfOsM72bpiJ8Ifeg9ms0tDHw",
        "userName": "Dell Boy",
        "userImage": "https://play-lh.googleusercontent.com/-pBanj5VdsBc/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucm4MuNyBvb-yB_FymUOgCfXKQdUQg/photo.jpg",
        "content": "App keeps crashing!",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/04/2020, 18:12:36",
        "replyContent": "Hello. We sincerely apologize for the fact that you experienced this. Please delete the current version of the app you have on your phone and re-download v.2.3.3. If you have any more issues, please send us an email at phac.arrivecan.aspc@canada.ca. Apologies again.",
        "repliedAt": "08/05/2020, 13:29:21"
    },
    {
        "reviewId": "gp:AOqpTOFr-V2z-sPDEuK7IheljH1c5iW2_bsM749yfkypk2iw-yDtBLepxBk3QxzLjyecr0yJD0ZXnnwlrqRQpA",
        "userName": "Andre Hila",
        "userImage": "https://play-lh.googleusercontent.com/-qIOCBTvetjk/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmb2hB2dvBfHm5U8JHQpsXGoqLOXg/photo.jpg",
        "content": "Bad",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/04/2020, 08:52:57",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOGPWnjP5AR49jQ6og3lVwdz_KRt0T64HHvwAIWXduXJaHl9ZTnD1I6DcFz8TakC8HOw6N9yFFh-3pa8qg",
        "userName": "Ryan Stewart",
        "userImage": "https://play-lh.googleusercontent.com/-eRXudOCBFj4/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnk_ioMLKD5bt7vukwR5h4l4qxcfA/photo.jpg",
        "content": "I like the idea, and it has made crossing faster for me. However i have to uninstall the app every day. It keeps crashing. I would also like to see an update where it saves my documentation numbers for faster set up. Once the crashing issues are fixed i will gove it 5 stars",
        "score": 3,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/04/2020, 07:53:56",
        "replyContent": "Hello. Thank you very much for your feedback. We will certainly keep this in mind as we look to develop future iterations of the app. Sincere apologies for the inconveniences, and all the best.",
        "repliedAt": "08/04/2020, 12:57:34"
    },
    {
        "reviewId": "gp:AOqpTOG0ezACRJebwhF1N7gtfHdaZu8x8hy2YjVyJBh2N160z69rQLJ_q0a4liysbDEp6CpK1UPHNAgJD81ZHQ",
        "userName": "paramveer singh sidhu",
        "userImage": "https://play-lh.googleusercontent.com/-EWkjxJmvT54/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucm9XRJTR4sTpGiwr_Tt39CQM3ijnA/photo.jpg",
        "content": "I can't even open the app. It keeps on crashing. On 4th Aug 2020 at 5:12 am",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/04/2020, 05:14:50",
        "replyContent": "Hello. We apologize for the difficulties that you experienced. Can you please send us an email at phac.arrivecan.aspc@canada.ca with some more information about your case? We will get back to you as soon as we can. Thank you!",
        "repliedAt": "08/04/2020, 12:54:30"
    },
    {
        "reviewId": "gp:AOqpTOGK0-xnsNT2-DAnFCYD1P_k3K8ocVVyd-DmtDjBYMO4Q08jWjiZtaz-XsJBXBF1rd5SCyj8mHs-CazLbQ",
        "userName": "M Nguyen",
        "userImage": "https://play-lh.googleusercontent.com/-CT550BzRWy4/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckoCNihs3WSobpIpirQ_-MnL6JqkQ/photo.jpg",
        "content": "Issues: 1. You cannot undo your answers. 2. It does not clearly define what entry point is. 3. It says to present an agent with your approval number. I did this and it did nothing for my processing at the border. 4. It cannot deal with complex names. 5. Needing an account to sign up is superfluous. 6. The app itself is superfluous. It did not help with my border crossing and I was told it was mandatory to complete it 2 days prior to my flight into Canada. It does nothing",
        "score": 2,
        "thumbsUpCount": 8,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/04/2020, 03:03:35",
        "replyContent": "We are sorry that you have had a negative experience with the app. While you cannot directly edit your answers to a form, you can simply resubmit the form again to include the correct responses. The app will process the most recent submission. If you have more questions, please don't hesitate to contact us at phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "08/04/2020, 13:32:53"
    },
    {
        "reviewId": "gp:AOqpTOE8pzevl2Vpd40TkSWEhKeuuyYfLjM4cvGeMZSkipvtULordigN4AcFM1MC1yZG-EMQBqJXxQcusiloUA",
        "userName": "bhumil patel",
        "userImage": "https://play-lh.googleusercontent.com/-1J-1OYAgHO4/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucln6U7wZFkgX1mqcOdN4_t7QOzaKw/photo.jpg",
        "content": "Can i use this app to submit form behalf of my relatives???",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/03/2020, 20:29:45",
        "replyContent": "Hi there! Yes, you can certainly fill in the app on behalf of a family member as long as you have all of their information.",
        "repliedAt": "08/04/2020, 12:44:22"
    },
    {
        "reviewId": "gp:AOqpTOE61RKg-qUxjTl0gyKku1dIpa2vPNf3TTRXaWUyeyZi49tBRUzM0LvzMzRWF1m1jnQV9UrYf_CHSKcSIA",
        "userName": "",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gh-mREvTbs24U4AvQmJGwzsDyaufPt8nRYRgzMEHg",
        "content": "Application sucks",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/03/2020, 18:05:56",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOGnuSeUO9_Z9Jv5iWPeG-SREL4MGWZxRdbnQ7d1hXGi3jDRBYkFeUEdh6JEPJvMkkVo-SNsX10dc2muUA",
        "userName": "Alexandre Chtouts",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gj7JcYN2DGlZJvvslg6Id7dDm4y_ihoqve7vPoHmj4",
        "content": "Keep crashing",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/03/2020, 13:19:39",
        "replyContent": "Hi Alexandre. We sincerely apologize. Can you please send us an email at phac.arrivecan.aspc@canada.ca? We will provide you with technical support as soon as we can. Thank you.",
        "repliedAt": "08/04/2020, 12:18:26"
    },
    {
        "reviewId": "gp:AOqpTOHE3XVttxuZkQWsIqAnU3__rlAiIcA3GNGrWNWpEU748SBFOhg_HHyRcAVBGveDD2JMf4RA1ewgUhD0zw",
        "userName": "A Google user",
        "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
        "content": "Good idea but garbage. Wont allow account to be setup..fix this rubbish please",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/03/2020, 11:44:09",
        "replyContent": "Hello. We are very sorry that you ran into trouble when you attempted to create an account. Can you please send us more information about what was preventing you from getting the account set up? You can reach us at phac.arrivecan.aspc@canada.ca. Thank you very much!",
        "repliedAt": "08/04/2020, 12:09:29"
    },
    {
        "reviewId": "gp:AOqpTOH_bauxMqNK-ds2sC42eaO679Vpz40B19q0oOhihM80ZvmXc_hVuaaRkNY5tWj-137Rrvgv08Jv-gumWw",
        "userName": "Bryan Wyatt",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GicGwe9spTu6mM4AGgqaJw7Zd2-vK148Pk_70hs",
        "content": "Everytime I enter the code, it says make sure the code is entered correctly. Tried 8 times given up now will take the wait time at the border.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/02/2020, 20:58:25",
        "replyContent": "Hi Bryan. That doesn't sound right! We are very sorry for the inconvenience. Can you provide us with more information at phac.arrivecan.aspc@canada.ca, so that we can look into this further? Thank you very much!",
        "repliedAt": "08/04/2020, 12:04:08"
    },
    {
        "reviewId": "gp:AOqpTOF5jmrVXNScBgJK5318XDK8bcv_B6HfpJ-0K_6KT6Iq8ByRkUT06AeA4fBUgcf29JMoPf2jVtkR_QfMKA",
        "userName": "Srikar Ananthula",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiY4p98RDQl4ILCLjQYy0uYPWQv0JtEEpJhJgo8xOo",
        "content": "It's crashes a lot , does not even open to submit details . Pls fix",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/02/2020, 16:55:56",
        "replyContent": "Hi Srikar. Sorry for this inconvenience. Please ensure that you have version 2.0.25 of the app downloaded. If you continue to experience problems, please send us an email at phac.arrivecan.aspc@canada.ca with details about what is going on, and the best ways to contact you. Thank you.",
        "repliedAt": "08/04/2020, 11:57:10"
    },
    {
        "reviewId": "gp:AOqpTOG6_gEGnLiFiIA1YKXH71A1mpzQpEFs-eV1c5nD58Q-ya6pYR1c2ate6TtxXnFOM_GFjL9DIoxGW5P76w",
        "userName": "Edmund Kim",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjkI0wW1esdWZLyA6BOzUYNre7yHC5hv1OuBuAP_A",
        "content": "App works then the next day crashes upon load. Super frustrating.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/02/2020, 12:36:07",
        "replyContent": "Hi Edmund. We are very sorry that you are experiencing this. Can you please email us at phac.arrivecan.aspc@canada.ca? We will provide you with support ASAP.",
        "repliedAt": "08/04/2020, 11:46:47"
    },
    {
        "reviewId": "gp:AOqpTOHtMR3W5o-mmKJr7prpa9-13M0tGTOO9HjOXBzYAwGAFBtvOs1TEG0o5hXo5GMgo7GD-mES2gE8L56Eaw",
        "userName": "Felipe Franco",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiBhaVaNqZvzN4Icp6RF4xYm3r6EXiQ3ipfwPnzDA",
        "content": "Lester b airport Toronto is not on the point of entry and it doesn't show the immigration Visa exempt travel option",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/01/2020, 21:44:25",
        "replyContent": "Hi Felipe. We really appreciate your feedback. Lester B Pearson Airport is listed as Pearson International Airport in the ArriveCan app, since that is the airport's official name. Please email us at phac.arrivecan.aspc@canada.ca to provide us with more information regarding your case re: your second comment. Thank you very much!",
        "repliedAt": "08/04/2020, 11:29:51"
    },
    {
        "reviewId": "gp:AOqpTOHEzgaYHubas0xNbjEjk5GSUCfgnOfNh98CVXq31cMOnGgW2XbM0FXfLSYJCoqkWihIxoOA4-RNmZb0fg",
        "userName": "Viktor Shikshnis",
        "userImage": "https://play-lh.googleusercontent.com/-AtsW3ibgoG0/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnc4VJ5lggb6AIlNYWVNkIQlD1oIw/photo.jpg",
        "content": "Crashes",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/01/2020, 20:46:15",
        "replyContent": "Hi Viktor. Can you please send us an email at phac.arrivecan.aspc@canada.ca? We will do our best to get to the bottom of the issue and assist you further.",
        "repliedAt": "08/04/2020, 11:20:19"
    },
    {
        "reviewId": "gp:AOqpTOGxs6JSnmi1xWAALa73mu9Dzu7caQUSE19WBca2J6YW5tmgfUELmgUHxUgh_TVbCX8WwIUNQUBVETTrYA",
        "userName": "Cecilia Haug",
        "userImage": "https://play-lh.googleusercontent.com/-i5lW563aXoY/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmY9ISmbgYL-4WCLUVgN2gOCL8P3A/photo.jpg",
        "content": "I need my password for my application for the fourth covid cheque please Cecilia Haug",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/01/2020, 17:52:42",
        "replyContent": "Hi Cecilia. There is a \"Forgot password\" function on the login page of the app. If you have any more questions, please let us know at phac.arrivecan.aspc@canada.ca. Thank you very much!",
        "repliedAt": "08/04/2020, 11:38:19"
    },
    {
        "reviewId": "gp:AOqpTOHDH6gq5FWmRf_PRwMm41Bcx2pKAH_O9vDb8MEtX8xrWlMIWmyoRNLaEunhqCqVN5dgT0Fmx-QaYWOsGA",
        "userName": "Norman Sue",
        "userImage": "https://play-lh.googleusercontent.com/-yykAndV4bYw/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclZhS66EnvhdNN0-JcfEax2OtsS8g/photo.jpg",
        "content": "I thought I would be diligent and filled this form out on this app ahead of time. It worked fine and I got a confirmation code. Then the next day, I went to actually travel back to Canada, and fhe app kept immediately crashing when I tried to open it. Force stop on the app did not help. Rebooting my phone did not help. The app just kept crashing immediately after trying to open it. I ended up having to fill in a paper version of the form at the airport. This app ended up being useless.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "08/01/2020, 14:04:17",
        "replyContent": "Hello. We are truly sorry that you experienced these issues while travelling. We have flagged your feedback internally. If you can, please send us some more details about what happened at our email here: phac.arrivecan.aspc@canada.ca. Thank you.",
        "repliedAt": "08/04/2020, 10:46:06"
    },
    {
        "reviewId": "gp:AOqpTOHIx4Nf5nC7uH2Xn-OR9RjOYBXTc4f_38FDlM5c9_Ntm8k_Va3t-KJKh8FpN_eb1xkE8arsQ7b1MjF1NA",
        "userName": "Joseph Gouveia",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GizIq9tlAiNw8h_4S-ungaZSzCCtgKOFsRNpBewew",
        "content": "Thus application does not work. I am an essential worker and travel to the US everyday, I have filled the application over the last 2 days and the information does not pop up on the CBSA system when we reach the point of entry.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "08/01/2020, 09:15:30",
        "replyContent": "We sincerely apologize. When you fill out the app, you should receive a confirmation number. It can later be found under a banner at the top of the main screen that says \"View your entry into Canada code.\" When you arrive at the border to enter Canada and you present your confirmation #, BSOs will also need to verify that your travel is essential.",
        "repliedAt": "08/04/2020, 11:09:52"
    },
    {
        "reviewId": "gp:AOqpTOEny2hUDA9hr8-j6MIN315UPVbjpv9thEC-ZykR6nXXa2EUe5fF3A6yFgJFpR4bdNEM_ZYu4tWRXP06qg",
        "userName": "Julia Ornaf",
        "userImage": "https://play-lh.googleusercontent.com/-szHX-iEU12o/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckXenBupKEo7nw3frUFifTdtogYbg/photo.jpg",
        "content": "Keep crashing:(",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/31/2020, 17:21:31",
        "replyContent": "We sincerely apologize. Please ensure that you have version 2.0.25 of the app downloaded. If not, I recommend deleting the current version of the app that you have on your phone and re-downloading the app with version 2.0.25. If you continue to experience the same issue after this change, please send us a note at phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "07/31/2020, 17:39:15"
    },
    {
        "reviewId": "gp:AOqpTOGgYATDbmJJeJRW37xkUN-_yeY3tHDU_ypGQtBo8Gu3KvyUCrVyXFXPm7SRXgy33Yw_cdaxdQCh76XFLQ",
        "userName": "Kitchens Zahleh",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgCrJqfojIEbukKA2fEzZny_wbIGI-M1xBCaddf",
        "content": "ne fonctionne pas",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "07/31/2020, 16:45:56",
        "replyContent": "Bonjour. Nous nous excusons sincrement pour cet inconvnient. Veuillez nous contacter  l'adresse phac.arrivecan.aspc@canada.ca et nous travaillerons avec vous pour trouver une solution. Nous vous remercions!",
        "repliedAt": "07/31/2020, 17:33:54"
    },
    {
        "reviewId": "gp:AOqpTOEYwtjWUwyokebbBTT3bv6fGbIRYWWQ0Odchhr8gzrRyOUw1MZLjuI00qOj5uGMg24mkLoICP84GlDjww",
        "userName": "jrjs111",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhBZDnEDIJoWiQntgTGR58aTS1PuZ5zc1qDaU_hog",
        "content": "Can't seem to get my code in my email, I even checked the spam folder, and nothing.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "07/31/2020, 08:52:41",
        "replyContent": "We are sincerely sorry that you are experiencing problems with the app. Can you send us a note at phac.arrivecan.aspc@canada.ca? We will get back to you as soon as possible. Thank you for your understanding.",
        "repliedAt": "07/31/2020, 10:46:12"
    },
    {
        "reviewId": "gp:AOqpTOFJGRcAkFrYpztSTLyAEh9jfanEOZ093t1HC8xYlAskxp6OlfRLXm4q3dEiiHOqlVICPusli6sKP0WtVg",
        "userName": "Can Emb",
        "userImage": "https://play-lh.googleusercontent.com/-OlXLL8z36fs/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucl3NgU9p6hQl7noIUq9aRopRp7Qsg/photo.jpg",
        "content": "Can't get past the waiting to download message, despite numerous tries.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/31/2020, 08:19:30",
        "replyContent": "Hello! That doesn't sound right! Can you email us at phac.arrivecan.aspc@canada.ca? We will work with you to get to the root of the issue and identify a solution. Thank you so much.",
        "repliedAt": "07/31/2020, 10:41:29"
    },
    {
        "reviewId": "gp:AOqpTOHx1tHRHLK-hwa8m1qZ1WxneXdI9dv2kBko-Fv5CK5EYL_1jF-cwuMZFWILr4xzu6AOPGO3WEkqeD4uPA",
        "userName": "Doug Higgins",
        "userImage": "https://lh3.googleusercontent.com/-QW_g2JslPKc/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucktkm41ACNuTDrMqP14HSM1AykrPA/photo.jpg",
        "content": "Worked for me.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "07/31/2020, 03:57:56",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFtuPhmX3w5WJpd8xf2evMYj4afbaqQhSJ8S1dt2_dIQIQIXosA85WAKbmno39QyEe-mdi01JnZ4e4ijQ",
        "userName": "H&R Comartin",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gj2_DeYZkUm0o40qzaPfxaDvdT8SmMC0kpnNJrn-Q",
        "content": "Put in all my info arrived at border and nothing there. I even received a number. App doesn't work very well",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.0.25",
        "at": "07/30/2020, 19:10:50",
        "replyContent": "Hello! We are very sorry that you had a negative experience with the app. Can you send us some more details about what went wrong? We will do our best to provide support. Thank you! You can reach us here: phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "07/31/2020, 10:37:33"
    },
    {
        "reviewId": "gp:AOqpTOEF5278FAz34W9MG2ovjIKtRQE35e_BYLRJMO7G0V327x6KRuVtkYcpaOG4gz3GPJd80TkmjYXx1prQ4Q",
        "userName": "bill dixon",
        "userImage": "https://lh3.googleusercontent.com/-Mdlh7AG6ujk/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclWO-PNLgJY8lLO8Y4xvE2A5amHwQ/photo.jpg",
        "content": "Won't even download let alone work.. 5 miles backed up at the ambassador bridge proves nobody did any testing.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/30/2020, 14:10:53",
        "replyContent": "Hi! We sincerely apologize for the inconvenience. Please ensure that you have the most recent update of the app, version 2.0.25, downloaded. If you continue to experience difficulties, please send us an email at phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "07/30/2020, 14:53:36"
    },
    {
        "reviewId": "gp:AOqpTOGXga6EUC4p14qrgVQjCMJfR1NnUX0zk5Ffdf3ULayvkfDAHGnd3xYNQfJffjZYd9EQY-MZLzRoAcLoKw",
        "userName": "albert morris",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgZcfeZu1n-N05WgTPLDRtd70HqayvpB4-k1zZa",
        "content": "this is frustrating and hbp giving",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "07/30/2020, 10:14:22",
        "replyContent": "Hi! Thank you for your feedback, and I am sorry that you are having some difficulties with the app. Can you send us an email at phac.arrivecan.aspc@canada.ca with some more details about what is going on? We will do our best to help.",
        "repliedAt": "07/30/2020, 14:46:40"
    },
    {
        "reviewId": "gp:AOqpTOHcieHLQDA_hVWYCIW-PEsH5bp9ZEah8dWf7i9ZTWIcETpP3nHn7WotligQDuMMyqBN-QSxkQ0abEsR5g",
        "userName": "Abbie Gosselin",
        "userImage": "https://play-lh.googleusercontent.com/-19nz5sXAgZ0/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmqPzoD3buUuybW3ANvoCaGgPtzaA/photo.jpg",
        "content": "Just 1 issue. I had to choose point of entry as Windsor tunnel because Windsor bridge wasn't an option. I always cross the bridge.",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.25",
        "at": "07/30/2020, 08:54:00",
        "replyContent": "Thank you for your comment! When you reference Windsor Bridge, are you referring to Ambassador Bridge? This is the official name of the bridge and it is included in the drop down menu in the app. If not, please feel free to reach out to us at phac.arrivecan.aspc@canada.ca and we can try to help you locate the proper point of entry.",
        "repliedAt": "07/30/2020, 14:24:46"
    },
    {
        "reviewId": "gp:AOqpTOEGgDHjyI1rj-Y6Ha3gumti7OoOYzHn2vR5uz4ATeZPkNbxJC6D5zN2fJ-WXEUIV1MwVKsXqY_DvRWSOg",
        "userName": "Chintan Vyas",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgOktKvJKywk7iqowxmRzuOzM1gYNXKGHVNAysF1Q",
        "content": "I got my device rooted and it doesn't let me use it because of that",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.18",
        "at": "07/29/2020, 22:56:33",
        "replyContent": "Hello. We apologize for the inconvenience. Can you please send us an email at phac.arrivecan.aspc@canada.ca? We can provide you with more information over email. Thank you for your patience.",
        "repliedAt": "07/30/2020, 14:16:45"
    },
    {
        "reviewId": "gp:AOqpTOHKoKBwSeJck6ItztmHeSE3igR2pEKK1ARiGL_tc22wZjw50Pfc72nRoGvk1QRnk56mVaP0gz4HQs-YTw",
        "userName": "Randy Brosseau",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiwVvj0H_XMTIV_Dyd0-3lp7L7U3Vj3RpSU04X6Sw",
        "content": "Cannot get past the create an account. It will not take the required numerical digit for the password. Tried to email the address that is provided on other reviews (phac. arrive an. aspc@canada) and it says its not valid,,, Nice!",
        "score": 1,
        "thumbsUpCount": 7,
        "reviewCreatedVersion": "2.0.18",
        "at": "07/29/2020, 16:56:35",
        "replyContent": "We apologize for the inconvenience and thank you for your feedback. You can reach us at phac.arrivecan.aspc@canada.ca. Let us know if you need further assistance. There should be no spaces between any of the characters in the email. Hope to connect with you soon.",
        "repliedAt": "07/31/2020, 12:15:54"
    },
    {
        "reviewId": "gp:AOqpTOFG374nDcmE27PSzwQR9vYDM3llvKNAfSdpWT_saHiHF0u2Vr_7PWZk5nCnLxqCHCkHN10A4QsS_twhGw",
        "userName": "David Coleman",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiUs2Lx41JjeuOGQBORnMjFzuGaOK7zbhx18zGz",
        "content": "Unable to create account. Software indicates my email or password is invalid.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.18",
        "at": "07/29/2020, 16:19:33",
        "replyContent": "Hi David. I am very sorry that you are experiencing this. Please email us at phac.arrivecan.aspc@canada.ca and we will support you further. Thank you.",
        "repliedAt": "07/30/2020, 08:16:16"
    },
    {
        "reviewId": "gp:AOqpTOFWe06CRHh5iFc1UTXkmgUJa9ACn8mR7VvkVECO1sJDOMUqGV1wq4-bVwV3tGCUpf-24TSXFZ9iNm6LJw",
        "userName": "Tamal Dutta",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgFeIHv3tQI_c0VG8TsRI6AeNZJcSdChZSkt814",
        "content": "Not able to register. The verification code never comes. Tried several times.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.0.18",
        "at": "07/29/2020, 10:01:39",
        "replyContent": "Hi Tamal. We would like to apologize again. If you have not yet been able to find the verification code, please email us at phac.arrivecan.aspc@canada.ca. We will get back to you as soon as we can.",
        "repliedAt": "07/31/2020, 12:13:53"
    },
    {
        "reviewId": "gp:AOqpTOEBoUHQrmfvDJdIYuIgoZndetOj-9F9zszuLBLgC_FDzOhEP1hR71Q523BK_D8btcgcckwTrMDPjrwkaQ",
        "userName": "Sam Halpern",
        "userImage": "https://lh3.googleusercontent.com/-NIBW963dfb8/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnDf1nw1wuVTd-WJjajl5H5VePZxw/photo.jpg",
        "content": "Not a user friendly app. Can't create an account. Keeps saying wrong password - lNot so. Can't reset pw. Thing goes around in circles.",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "2.0.18",
        "at": "07/29/2020, 08:23:31",
        "replyContent": "Hi Sam. We will look into this issue for you. Can you send an email to phac.arrivecan.aspc@canada.ca, and let us know what type of phone (Android or iPhone) you have? Thank you!",
        "repliedAt": "07/29/2020, 12:36:07"
    },
    {
        "reviewId": "gp:AOqpTOGAYOQVOc9B8TYJPfUslxkVGEQj5I41vYsrDEuSoAzBDlwY-Ke97PFYxdVHZwTkYKMSJLAc7QJrtQVdRQ",
        "userName": "Kulwinder Dhillon",
        "userImage": "https://play-lh.googleusercontent.com/-pf0WQom7uNg/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucns2EMQ4bd-fBMnVIKcP6OmWt6NRw/photo.jpg",
        "content": "Good",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.18",
        "at": "07/29/2020, 06:51:04",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOHCQ4gIk1BrG_J9wkmaVdpCrhZtreKEiLf3g6LcTQfwdz82CbNvrcdQFXA9TKCiFvIq0M67uNFV-w64fg",
        "userName": "Peter Reilander",
        "userImage": "https://play-lh.googleusercontent.com/-zWxd5PGEHh4/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuck8qyUt4qVhMbrEfMCO6nbnCH9xrA/photo.jpg",
        "content": "Entered the verification code and it was rejected. No further instructions.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.18",
        "at": "07/28/2020, 18:34:34",
        "replyContent": "Hi Peter. We apologize for the inconvenience. Can you please send us an email at phac.arrivecan.aspc@canada.ca? We will do our best to help. Thank you kindly.",
        "repliedAt": "07/29/2020, 12:30:44"
    },
    {
        "reviewId": "gp:AOqpTOFSuUuVegH3XVRSCO3cx-padsbeGCdqoKLBS6imgcR7pwm3yxkXOfwqmJIQjs3OdOE7kvZ_E_FQOTJkZA",
        "userName": "Jim Jariett",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiJqZg7yBQFVqMztiDNacIYjT_0gnDTTUjKlD_n",
        "content": "Will not send a code to reset",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/28/2020, 14:57:41",
        "replyContent": "Hi Jim. Just following up to see if you were able to find the verification code in your email. If not, please send us an email at phac.arrivecan.aspc@canada.ca with your contact information, and we will do our best to support you.",
        "repliedAt": "07/31/2020, 12:04:01"
    },
    {
        "reviewId": "gp:AOqpTOF8OXNSlQ2DeAMPxBHz3izlU_CsWPRlrSoSX-0IMGHsrRHygJc1WbfuZjgMl64BxEDyF3Al8g9c6EPZQQ",
        "userName": "Adam Tamura",
        "userImage": "https://play-lh.googleusercontent.com/--srUBJfCbXw/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnIbqPMoDo9SMltsAekVmuyBZhDgw/photo.jpg",
        "content": "It keeps crashing. The main feature of filling the form prior to arriving in Canada is simply not working. It works the first time, but if you close the app and try to open it again, it crashes. So I reinstalled the app and for my surprise, it didn't save any of my progress. The suboptimal solution I reckon is to fill the form up just before arriving and leave the app open until full conclusion.",
        "score": 1,
        "thumbsUpCount": 32,
        "reviewCreatedVersion": "2.0.18",
        "at": "07/28/2020, 13:52:57",
        "replyContent": "Hello. We sincerely apologize for the technical issues that you faced. Please send us a note at phac.arrivecan.aspc@canada.ca and we will assist you further. Thank you.",
        "repliedAt": "07/28/2020, 16:35:55"
    },
    {
        "reviewId": "gp:AOqpTOHPeGMtROjhTT1mG9FGtyT6s4OS1CBJU0CXWWIbdW22XC0I8pCYfQwpYgG56FaNJoC8I1LeG3T_OlZs9Q",
        "userName": "stephen mejia",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gj-eGvRF_rmkRIIJyITUbwrbK0qTa1_tErn5y712Q",
        "content": "The app keeps crashing. I registered everything but after doing that it keeps crashing.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/28/2020, 11:07:30",
        "replyContent": "Hi Stephen. Apologies again for your troubles. Please let us know if the app continues to crash when you use it. If so, please email us at phac.arrivecan.aspc@canada.ca with the details of your case and your contact information. We will get back to you as soon as we can.",
        "repliedAt": "07/31/2020, 11:59:40"
    },
    {
        "reviewId": "gp:AOqpTOHm7Re4BmwLhYsgXrP1vUcocPTlBfJsqV6xTN0JxRkS03I4s2tV50VsK1SuFk6UPaWzhMCHe_O1nlXJIg",
        "userName": "C Chamb",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiTRik6EMPkmLB3wLYdA4odu1A82VKgvy2B4Fza",
        "content": "The language in the app says that those exempt from 14 day quarantine are individuals who crossed to perform essential work, but the actual order states that exemption from quarantine should be those performing AND RECEIVING an essential service, e.g. a Canadian resident who travels into Michigan for a specialist appointment should be exempt from quarantine (as long as they didn't stop anywhere else), because they are receiving an essential service. The language on the app should be corrected.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/28/2020, 10:53:51",
        "replyContent": "Thank you for your comments on ArriveCAN. There is no exemption from quarantine for travellers returning to Canada after receiving medical treatment in the US. The exemption is specifically for a person entering Canada for the purpose of receiving essential medical services or treatments in Canada. This is to help protect Canada from COVID-19.",
        "repliedAt": "07/29/2020, 12:22:45"
    },
    {
        "reviewId": "gp:AOqpTOEjINNnvpyBh3a1pDJo0LS-in9QFyh9pQWZyxQCwdVFloYBSo_FwXk2o5KC8CruFAAyqxlnNW0OgEd9Bw",
        "userName": "Daniela Knowles",
        "userImage": "https://play-lh.googleusercontent.com/-JkKiI_V7Ch0/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckX5E3unBJ8Vf-kOudtBARwyNyKTA/photo.jpg",
        "content": "I put verification code in and said my email was not valid",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/28/2020, 10:42:01",
        "replyContent": "Hi Daniela! Please let us know if you are still facing this problem with the app. If so, please send us an email at phac.arrivecan.aspc@canada.ca with the details of your case and your contact information. Thank you!",
        "repliedAt": "07/31/2020, 11:54:05"
    },
    {
        "reviewId": "gp:AOqpTOHLID1UUGcT9TqndgKDKo7yVOLzBTJnfMHS41SFQN-RNzBjypyU6iT7as70_WJNg4RSiVUIHzkxiBxecQ",
        "userName": "Shachar Weis",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiZ4pjX6VNRZtm6mLOGh2gImyeaTimZQrKfCRel",
        "content": "Worked the first time, now it just crashes",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/27/2020, 22:50:00",
        "replyContent": "Hello! Just following up to see if you are still struggling with this problem. If you require assistance, please send us an email at phac.arrivecan.aspc@canada.ca with your contact information. Thank you so much!",
        "repliedAt": "07/31/2020, 11:47:46"
    },
    {
        "reviewId": "gp:AOqpTOGxsAIzJ9ZOtd-vJd4AeIn6WDusy5BYrSqMTHWSgmARJX35tOjqKkFdLA7Llf_Tcx0w4UeZz7MKNEWo2Q",
        "userName": "T",
        "userImage": "https://lh3.googleusercontent.com/--fq01HWk4l8/AAAAAAAAAAI/AAAAAAAAaN8/AMZuucl9E8HfEj8LVH_OwRn1T3iUaa2WMA/photo.jpg",
        "content": "It keeps saying come back in 48hrs to log symptoms but it's been over 48 hrs and it's still asking me to fill an arrival form, which I've done multiple times on the app. Great idea, terrible execution.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/27/2020, 15:19:42",
        "replyContent": "If you have already arrived and crossed the border into Canada, the only remaining step is to complete the COVID-19 symptom self-assessment through the app. It shouldn't be continuously prompting you after you attempt to fill it out. Please reach us at atphac.arrivecan.aspc@canada.ca so we can help you further. Apologies for the inconvenience.",
        "repliedAt": "07/28/2020, 15:54:37"
    },
    {
        "reviewId": "gp:AOqpTOEXmPMYIC8k89x1RTGrBSAiFEcXpoopPZPe60K0lS0hNqPAUWHOsRwMg-gSZ5hdKQdb4egT-MryTSdowA",
        "userName": "Karen McKenna",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gg8D_fVbh4hEzHoWRbYLeojUjNJnm4t43ObbpGEZA",
        "content": "I am unable to create an account. It does not give an error message.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/27/2020, 14:54:54",
        "replyContent": "Hello! I am sorry that you are experiencing this. Please send us an email at phac.arrivecan.aspc@canada.ca and we will try to figure out what is preventing you from being able to create an account. Thank you for your patience.",
        "repliedAt": "07/28/2020, 14:22:25"
    },
    {
        "reviewId": "gp:AOqpTOHLiGtZX5WiWDCHUc3mRj2Hpppg8fkSBRexEJ4730H2MrD2jOMlW9kE2QSVWZU2-KXaAIMlL7vaZyfXDg",
        "userName": "rose balko",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgFWj4lCaOl3N5vzI4R56B_E4swQkHkuE7Toi3LUQE",
        "content": "It says the app is installed but there is no icone on mh phone. When I attempt to re-install it again, I am presented with a message indicating the \"app will be installed soon\". There is no open toggle to proceed. I am using a brand new Samsung Galaxy Note 10 phone.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/27/2020, 06:00:50",
        "replyContent": "Hi Rose. Thank you for reaching out. Please send an email to phac.arrivecan.aspc@canada.ca and we will do our best to assist you.",
        "repliedAt": "07/27/2020, 15:56:00"
    },
    {
        "reviewId": "gp:AOqpTOHiT1UtMtQaEknHZbRc-dT83WFMBkQY3MUbvj8AIvt5Z0TF5ybMqkr3vlRrb4gBpd2LoTJuCp5oX8iGjg",
        "userName": "Sam Stephenson",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjRHOvk2IFipkJpUr1zAmPzYsJyfAgdzis-06YNQ28",
        "content": "What is the deal with this app? Completely broken and can't even make an account.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/26/2020, 20:09:35",
        "replyContent": "Hi Sam. We would like to apologize again for the negative experience that you had with the app. If you have any more questions or continue to experience the same problem, please reach out to us at phac.arrivecan.aspc@canada.ca with your contact information.",
        "repliedAt": "07/31/2020, 11:38:59"
    },
    {
        "reviewId": "gp:AOqpTOGNzldfwSNTuRacu2QybpXsrwuxxxJ4aGm97l6xbL1JbcZl1riwmmP5YOS1pNRz1_AMZPGM6fJ7oQaFkQ",
        "userName": "Arifa Hadaway",
        "userImage": "https://play-lh.googleusercontent.com/-2ZXvu_qK_gI/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnZ0B3t5xViU070Mhz_asr6on5KVg/photo.jpg",
        "content": "This app is ABSOLUTELY horrible. You are requested to create an account and then they send you a verification code. When you go to retrieve it you can't go back and when you try again it says invalid email. There is no support. Very unfriendly app. I don't recommend it",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/26/2020, 10:00:04",
        "replyContent": "Hi Arifa. Thank you for your feedback and sincere apologies for the inconvenience that you experienced. We have contacted you via email to help. Hope to connect with you soon.",
        "repliedAt": "07/27/2020, 15:43:22"
    },
    {
        "reviewId": "gp:AOqpTOGTo7e10DLIiTAnetEXZvkvvS78334T14IFIcx2J2mFM4-tP4_W2Z54vHZAqpd4VAUin3f3SFIs9CRIxw",
        "userName": "pranav chandratre",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Giih6MpdngC40wX5zQiDd-rbr6VX3Tq0c5QkVaP",
        "content": "App worked like a charm till I filled up the form. After that it keeps crashing. I'm landing on 30th July 2020. I hope the issue will be resolved by then.",
        "score": 2,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/26/2020, 03:11:26",
        "replyContent": "Hi Pranav. We just wanted to follow up regarding this request. If you need any additional support, please don't hesitate to reach out to us at phac.arrivecan.aspc@canada.ca. Please include the email address that you used to try and create an account. All the best.",
        "repliedAt": "07/31/2020, 11:20:44"
    },
    {
        "reviewId": "gp:AOqpTOFdt5OrBFI040ChCALM0f_mSRoGHFNLirl0sE_LEX8YL90OPUDKDxO9j3HLKRMk_IidWBNcXnUYvbfvkw",
        "userName": "Arno van Aalst",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Ghb12_BZuJci2GdSgNP7FYhnNNcdNf4ihE_DYPQeQ",
        "content": "I cant use it on one of my phones. I'm using Android 10 on my old S7. Why does it check if my phone is rooted or if I'm using a official Android version. One my other phone I'm using Android 6. Can't install it either because you consider this to old. Why?",
        "score": 1,
        "thumbsUpCount": 7,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/25/2020, 13:51:48",
        "replyContent": "Hello. We apologize again for your experience with the app. If you have any more questions, please send us an email at phac.arrivecan.aspc@canada.ca and note the email that you used to try and create an account. We will try our best to help solve the problem.",
        "repliedAt": "07/31/2020, 11:14:01"
    },
    {
        "reviewId": "gp:AOqpTOHK9bEGBUCfMVbxjElI7sslpJ3qaMULmWfxtBrtr74qZkcTWF8EsKs50uGfi_Ntmi-xhPUQr96FoCwNrA",
        "userName": "Connor Sullivan",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgKXU-d755KdR5F5fR_zqswpUfchhOmh4amOAtu_g",
        "content": "App keeps crashing. Was able to initially fill out form and received confirmation code, but when I arrived in Canada the app kept crashing. If I hadn't have screenshotted the confirmation code I would have had to fill out the paper form.",
        "score": 1,
        "thumbsUpCount": 17,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/25/2020, 13:31:17",
        "replyContent": "Hi Connor! Apologies again for your troubles. Please don't hesitate to reach out to phac.arrivecan.aspc@canada.ca if you have any more questions or concerns. If you send us an email, please note the email that you used to create an ArriveCan account.",
        "repliedAt": "07/31/2020, 10:32:26"
    },
    {
        "reviewId": "gp:AOqpTOE7NKqtpLlwoJ9aZrqISqLxWDosGUcW0TFrsHTO5ZbQ5I1-MbgriS3yHi1iCXjwxaV_Hgrcp6dDWblkmA",
        "userName": "Anthony The chief",
        "userImage": "https://lh3.googleusercontent.com/-peGxvumvodk/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnQLzQWHGaovPhb8Da3_VC-GztjMg/photo.jpg",
        "content": "Absolutely amazing has useless this app is. I leave the app to check my email for the verification code & it doesn't let me get back to the page to enter the verification code.",
        "score": 1,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/24/2020, 23:03:35",
        "replyContent": "Hello! We are very sorry that you had a negative experience with the app. Please send us an email at phac.arrivecan.aspc@canada.ca and we will work with you to resolve the issue.",
        "repliedAt": "07/27/2020, 14:26:45"
    },
    {
        "reviewId": "gp:AOqpTOEYDzJ_japKKFnw9aiCjrCkgPY2dvrIXi-lv_5pHCShHgCSVPM-gEsXEIgxWsLgrgoCzzvsY2gTNQd3IQ",
        "userName": "kommagiri vks",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gg_r_SlcdT6i9HjYPjBBRDL4I0cr3zHzUy2lW9Y3xE",
        "content": "Error",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/24/2020, 06:34:20",
        "replyContent": "Hi! If you are still noticing this error, please send us the details about what is happening as well as the email address that you used to create the account. You can contact us here: phac.arrivecan.aspc@canada.ca.",
        "repliedAt": "07/31/2020, 10:22:36"
    },
    {
        "reviewId": "gp:AOqpTOGIqIyTNnZ93GH-D8_QqYdW8yMbJ58mZuYW3lC2IkBOk_BdvDnHmhST8TZbMklHv7LXDyHI4OiVpxPgXg",
        "userName": "Chi Zhang",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjfZU-nTPPM5HNJvFKLsrUpyni8pzXBSWDZ1wz4T6g",
        "content": "We are stuck at the registration page, no verification code was ever received, every time we switched between apps, this app just went back to its initial page, so we had to start all over again. Why releasing an app that no fully tests are done?",
        "score": 1,
        "thumbsUpCount": 12,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/23/2020, 21:14:07",
        "replyContent": "Hello! Sincere apologies again for these difficulties. If you are still noticing the same problems, please email us at phac.arrivecan.aspc@canada.ca with the email address that you used to create an account, and we will get back to you as soon as possible.",
        "repliedAt": "07/31/2020, 09:57:47"
    },
    {
        "reviewId": "gp:AOqpTOGYWtIh3qjJ7ZJukGZVPtDVL7S8u6D2nbD2GVzNJdjI1bgDxrZHRPl3n0sFOqxxmY8Q9a4CyGx6Ep_nfg",
        "userName": "M. Hassani",
        "userImage": "https://play-lh.googleusercontent.com/-T5N-mE4OCgE/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucmh9HW2nMMrN30CvKeJ9syiQNFffg/photo.jpg",
        "content": "Trs bonne ide . App trs simple  utiliser",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.16",
        "at": "07/23/2020, 09:41:32",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOHz9qMhaiy1Om8GDG7Sg3rTIcJzs1UH-Gg2gYIyADR7IMdx-rfQKujWbnREP3mqOQzwhQJln_9VZsAVeg",
        "userName": "Samson Anthony",
        "userImage": "https://play-lh.googleusercontent.com/-cfLoV5NdKDE/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucm_24Bt_f_gquv9GeuI4L8SWUYxTQ/photo.jpg",
        "content": "Is not downloading",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.15",
        "at": "07/22/2020, 09:01:25",
        "replyContent": "Hi Samson! If you are still facing this problem, can you please send us an email at phac.arrivecan.aspc@canada.ca? Thank you very much.",
        "repliedAt": "07/31/2020, 09:45:35"
    },
    {
        "reviewId": "gp:AOqpTOH88bmWvkCznnbuffHgJrberGPU7DjKyaq6eR7UXDf8HGXkfKWv843FZz998m1Q56mJbxkVG4l_KLUcwA",
        "userName": "Winston Chan",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Ghs76LLn0ihJjzs0GCark440VZAvdKuxv23AMZKaJA",
        "content": "Unable to open the app at all - crashes immediately upon opening",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.15",
        "at": "07/20/2020, 22:17:11",
        "replyContent": "Hello! If you are still experiencing this issue, please contact phac.arrivecan.aspc@canada.ca and we will work with you to identify a solution. Thank you for your patience.",
        "repliedAt": "07/22/2020, 13:32:32"
    },
    {
        "reviewId": "gp:AOqpTOFnInZo9Yh0IggU9LFWGuJTUCvd1Fp2qr-0RnwsN4aAVySGi9bi9isIV-riWHef30PT-8vqPxVCc1sJMQ",
        "userName": "H SB",
        "userImage": "https://lh3.googleusercontent.com/-vcz_d2WuoKI/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucllN-mPdfB590PUznCyly0c9Z0p3g/photo.jpg",
        "content": "Great",
        "score": 5,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.15",
        "at": "07/19/2020, 17:37:20",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOHmWBjXZTEgJ8nnwcA6ypA1wKrJtUL4CDF7_I9DT1Ai6evx3yUS8sX24CChwAZOmhyZlgDI3W_ZpipAPQ",
        "userName": "Jared Tamana",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gi6sB4d9YqTdX7veKga4zOCaMiXpbq-ceNtPiRYdtw",
        "content": "Completely useless on any device with a bootloader unlocked. Way to punish device developers, guys.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "2.0.11",
        "at": "07/17/2020, 22:58:19",
        "replyContent": "Hi Jared! Can you please send us an email at phac.arrivecan.aspc@canada.ca, and include the email address that you used to try to create an account? We would like to hear more details about your case so that we can help. Thank you very much.",
        "repliedAt": "07/31/2020, 09:37:23"
    },
    {
        "reviewId": "gp:AOqpTOHhVO_B5kJACGofvFcn4fcTJPswTXQG37aKrkrgJAmJm-J-eQaIySPFinSb8pA977RBQTu-2l3F3TG-vQ",
        "userName": "Ian Brogden",
        "userImage": "https://play-lh.googleusercontent.com/-geInWeZfYSg/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclzXr0pbeYBGKFyFNy44ipUAj1IxQ/photo.jpg",
        "content": "Password reset function doesn't work. Never receive message. Where do we find out that the Ivy Lea Bridge port of entry is apparently called LANSDOWNE?",
        "score": 2,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "2.0.11",
        "at": "07/17/2020, 19:55:26",
        "replyContent": "Hi Ian! If you are still experiencing this issue, please send us an email at phac.arrivecan.aspc@canada.ca and include the email address that you used to try to create an account. We will do our best to help get the problem resolved. We have raised the port of entry names issue with our team.",
        "repliedAt": "07/31/2020, 09:30:53"
    },
    {
        "reviewId": "gp:AOqpTOFuorYKIDbHr3a8b32YQz1F2UtJhmHvjW7Z7yVVkdw7xVkjPLZkkjhyyKZuJXKIqDVCTmc_okPlweR4VA",
        "userName": "sevi m",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgG9l5V2Ua2215NguFhEQyhNXzDxXIV-axybqZVlg",
        "content": "The app is fine, but as of 14/7/20 you still don't need it. You still have to fill in the paper quarantine form whether you've got this app or not. The only thing they could maybe change in the app is provide a checkbox like \"have no plan for quarantine\" for the case where don't have the ability to make an appropriate plan.",
        "score": 3,
        "thumbsUpCount": 20,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/15/2020, 08:58:05",
        "replyContent": "Hi Sevi, thanks for your feedback and sharing your experience. The app is meant to replace the paper form. We will  follow-up with staff on the ground to ensure border service officers are well-informed about the app. Apologies for the inconvenience.",
        "repliedAt": "07/15/2020, 11:03:14"
    },
    {
        "reviewId": "gp:AOqpTOH-3gI_n23YEyRI4t0acXIxaaJa4ydQBffxp3PAMw0BeoUlQvoUQan9rjjalizEkMkPpbiqa8tsaUzQLw",
        "userName": "Sam Lin",
        "userImage": "https://play-lh.googleusercontent.com/-8UEMPbr9Ys0/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucl0GV2rp_oTO1SMN6rw8t7Kj3Cm9w/photo.jpg",
        "content": "So can ANYONE tell me what this token number is?? Says on the app there are signs posted in the airport of what the token number is, and NO ONE know this, not even the custom officers. Money well spent...",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/13/2020, 22:38:51",
        "replyContent": "Hi Sam, thanks for your feedback. We will continue to follow-up with staff on the ground to ensure tokens are clearly visible to travellers, and border service officers are well-informed. We will continue to work to ensure the app meets its objective of making the process easier and faster. We apologize for the inconvenience.",
        "repliedAt": "07/14/2020, 18:07:45"
    },
    {
        "reviewId": "gp:AOqpTOG7pwmPjuMetGrf8OdxlBLuXNeffjHzKix5mUi93UsE5Yhiokthz5T5nWyelApX6SeIoJJrnU7gcisUfQ",
        "userName": "Henna Khan",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiyKGE4jVAmwQugEj5CKCN5RAaJLFJkTjGCq_it",
        "content": "Are you able to fill these up on behalf of ur family who wouldnt be able to use the app?",
        "score": 3,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/13/2020, 18:45:15",
        "replyContent": "Hi Henna, yes, you can certainly fill in the app on behalf of a family member as long as you have all of their information. You can input your information up to 48 hours in advance of travel.",
        "repliedAt": "07/14/2020, 18:05:33"
    },
    {
        "reviewId": "gp:AOqpTOGBLbjNoYZvJiB4m-4Vp5Syn8ytooatUeXev8iFAt8d35RHaNhKU8xgl0cJ86rvlEfV7jWS3XUUkUXsog",
        "userName": "Jay Riddy",
        "userImage": "https://play-lh.googleusercontent.com/-EFDyK2bFs6U/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucndn4K5S36k49yExriR3MLZmiLwTQ/photo.jpg",
        "content": "I have tried to install the app and it tells me that the app will be installed on my phone soon. That was a few days ago. I tried it twice. How am I supposed to get this on my phone?",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/13/2020, 12:26:04",
        "replyContent": "Hi Jay, thanks for your feedback. We will check in with our development team, but this could be an issue with your service provider. Make sure you have a strong internet connection when downloading the app. Also note that you can only input your information up to 48 hours before arrival into Canada.",
        "repliedAt": "07/14/2020, 18:03:39"
    },
    {
        "reviewId": "gp:AOqpTOGuc1F65JPbHxu-Ck7T59N2X0IYDWtDo_JuDIw3LL1ROtuTnabZNf5DeA4PkwSji6XTKyc4cg3YPeBQlQ",
        "userName": "Paul Ashton",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Ghxam2r3CTPjionc2I14iyENHz2PeBh3uDQP2vsvQ",
        "content": "Useless app, nobody knew anything about it in YVR airport when I arrived June 11th. Was told to fill in a form at a table, pens provided on table for thousands of people to touch, no sanitizer. If I get the dreaded plague it will be from YVR airport because the officials were clueless. What a joke Canada........ Again.",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/12/2020, 18:28:55",
        "replyContent": "Hi Paul, thanks for your feedback. We will continue to follow-up with staff on the ground to ensure border service officers are well-informed about the app, and to ensure the app meets its objective of making the process easier, faster and safer. The health and safety of Canadians continues to be a top priority. We apologize for the inconvenience.",
        "repliedAt": "07/14/2020, 17:43:29"
    },
    {
        "reviewId": "gp:AOqpTOFiorPzWVIc_8Ndo_J4KkaZqLEqVGWMtcpaa2ijLHGOThFN-p-IhZpJ0QMH24pkp2I6fctkZ-oQAW0E5w",
        "userName": "Chintan Dave",
        "userImage": "https://play-lh.googleusercontent.com/-36Hwr-1xm0Y/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuck3x4Qzoeqf4KEps7cdmqfBI54EmQ/photo.jpg",
        "content": "The app itself is OK. But the border officer has absolutely no clue what it was. They has signs posted here and there regarding arrive can app token code including one against the border officer cubicle but she was clueless about it. Why would govt waste tax payers' money on such thing which is ultimately useless. Rather use the money to top up people's cerb payments instead.",
        "score": 2,
        "thumbsUpCount": 7,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/11/2020, 07:26:51",
        "replyContent": "Hi Chintan, thanks for your feedback. We will continue to follow-up with staff on the ground to ensure border service officers are well-informed, and to ensure the app meets its objective of making the process easier and faster. We apologize for the inconvenience.",
        "repliedAt": "07/14/2020, 17:39:17"
    },
    {
        "reviewId": "gp:AOqpTOGuQF5Hy3LquBCP7hfdUB7wNBfsSATzTMDWQ-D-9gUUoPOlp23b6fsmEJWp6r9FkvCpJbJj-1Wvze85JA",
        "userName": "Kenneth Anderson",
        "userImage": "https://lh3.googleusercontent.com/-M4CpUQHyxKM/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckHfTTIdTGK5VNbIhdIVD0KHVCLNQ/photo.jpg",
        "content": "Having had all the usual problems described with this app I discover it is in experimental mode and can only be used in 2 places. This should have been clearly stated at the beginning. A waste of time especially in these stressful days. Ken Anderson",
        "score": 1,
        "thumbsUpCount": 10,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/10/2020, 13:41:14",
        "replyContent": "Hi Kenneth, that you for your feedback. We apologize for the inconvenience. The app should be available at most ports of entry. We will pass your feedback along, and continue to work to ensure the app meets its objective of making the process easier and faster.",
        "repliedAt": "07/14/2020, 17:34:44"
    },
    {
        "reviewId": "gp:AOqpTOF0ozEI-QXfFHCQq87bAHjWJeWFjTZmgpTkn2VqfIhpeJyiLPNt1-JJzxLepsdizX3kMNbeOErxN2iwfA",
        "userName": "Alex Ander",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gi34-0_gLTllR84yrD6uBk9B8p-tbnjB8JP8RQNOA",
        "content": "What was the point of this? Why is it on the website? Why are signs of it posted in the Vancouver Airport? It's not used for anything. And what is that number they ask for in the last question? Wasted my data and privacy downloading this. It's absolutely unnecessary. There are other forms to fill out - that they don't hand out on the plane to help you pass the time. Instead you have to wait in a social distancing line to fill them out on site in the airport.",
        "score": 1,
        "thumbsUpCount": 16,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/02/2020, 18:13:17",
        "replyContent": "Hi Alex, thanks for your feedback. The purpose of the app is to collect information needed to help contain COVID-19. Filling in the app is a replacement for the form on the ground. We will continue to work to ensure the app meets its objective of making the process easier and faster, and apologize for the inconvenience.",
        "repliedAt": "07/08/2020, 16:49:33"
    },
    {
        "reviewId": "gp:AOqpTOGVW8O2xsLfeyVHlieAFUfZEZ7KqW6rPBGT3lcU4kIbgidSaa_iEWMlF9H3f11FC6Yr0hrcKplUUI8LOg",
        "userName": "Michael Sliwinski",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhDYyXGi2hm5cauFPAV9Wqa5Sjfi6J0hpMONEyKyg",
        "content": "A complete waste of time. Border personnel unaware of the app and no token provided. A perfect example of government waste and miscommunication.",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": null,
        "at": "07/01/2020, 09:37:55",
        "replyContent": "Hi Michael, thanks for your feedback. We will continue to follow-up with staff on the ground to ensure tokens are clearly visible to travelers, and border service officers are well-informed. We will continue to work to ensure the app meets its objective of making the process easier and faster. We apologize for the inconvenience.",
        "repliedAt": "07/08/2020, 16:41:31"
    },
    {
        "reviewId": "gp:AOqpTOGIn_l5WuNazQtw87A4r4HwOmWLmVEDW6PZJMIw1YH7z_J-h2WpiYjOmiKqjJmDhJxSStM3yoT7xJQgsw",
        "userName": "Catherine Martell",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gg6Z83uS70m6CXnS46Zb8mVafCjeMokIVNujEXXHA",
        "content": "Seriously useless. Downloaded it on 1 July and it does not accept an entry into Canada later than 3 July !",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "1.4.0",
        "at": "07/01/2020, 06:45:40",
        "replyContent": "Hi Catherine, thanks for your feedback. You can only submit your information up to 48 hours in advance of your arrival into Canada. This is to ensure that any symptoms you have are reported accurately. Please check back a day or two before your planned arrival into Canada.",
        "repliedAt": "07/08/2020, 16:40:39"
    },
    {
        "reviewId": "gp:AOqpTOEcF34rA29AK_1S4ut3o8wvabkMjV9jXPRZM7iwBtsBrWmx27gUYPHb3Jcop-ohaJ-CFUG_nU0p0KmeCQ",
        "userName": "Zeenat Zahir",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhX4myi51HvMpkh7Q4GLu8WxhnAq51xCpUszK47Bw",
        "content": "I will come to canada on 28 August but the calendar is freeze on June. So couldnt enter data",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/28/2020, 04:41:46",
        "replyContent": "Hi Zeenat, thanks for your feedback. You can only submit your information up to 48 hours in advance of your arrival into Canada. This is to ensure that any symptoms you have are reported accurately. Please check back on August 26 or 27 to input your information.",
        "repliedAt": "06/29/2020, 16:08:26"
    },
    {
        "reviewId": "gp:AOqpTOGorPEb_pie1v358aGmDuzaPLt80EWJRoF6ySO5cxs5leaCtInyVZGgJYct2Ug4ftBzu5Kd1DywwZIxgA",
        "userName": "Matteo Sivilotti",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgkHxf4fEo4rqu_alsZ0-m852S1lQJjzM0la8aTHg",
        "content": "Useless, crossed the border in Windsor today, none of the officers knew what it was and I didn't get a token either. I just had to tell them what was my 14 days quarantine plan to go see my wife and I was able to pass. The agents at the border were really nice, I haven't seen my wife since March and now we are finally reunited. You don't need this app.",
        "score": 1,
        "thumbsUpCount": 4,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/27/2020, 14:00:57",
        "replyContent": "Hi Matteo, thanks for your feedback. We will continue to follow-up with staff on the ground to ensure tokens are clearly visible to travellers, and border service officers are well-informed. We will continue to work to ensure the app meets its objective of making the process easier and faster. We apologize for the inconvenience.",
        "repliedAt": "06/29/2020, 16:05:37"
    },
    {
        "reviewId": "gp:AOqpTOGTI0RrxkIu_zU-xWxmFRfK3D4xNdIpk5qctHD9kUsQig8bPPiNAlRwHQMmUX1A6DlvdTFygLVnIn59Iw",
        "userName": "Zimmim Ahmed",
        "userImage": "https://play-lh.googleusercontent.com/-ODubCZ3lQgM/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckMJC1R1__nx8q7KgbE9lsU-xWswg/photo.jpg",
        "content": "Hi. I have a question regarding options under \"Destination type\" Im an international student and have already completed 2 semesters there. I have a appartment rented to myself where i used to stay. I had gone to meet my parents during my semester break and got stuck there. Now do i select \"Returning home\" or \"hotel, motel, hostel or rental accommodation\"",
        "score": 5,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/25/2020, 09:12:45",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOH1n6tjjGncHCuTIJOT957aAdXIkYoaGQOWyxvfyWpfHbD4o1XEWoWy6da_U6g2V3NwB64wvDQEG8oKaw",
        "userName": "John Pottinger",
        "userImage": "https://lh3.googleusercontent.com/-hcYq_x0Zt7s/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckMDyejPw4iEohisTzihwBtdysk1w/photo.jpg",
        "content": "The list of Ports of Entry does not include the main road entry point between Surrey BC and Blaine WA.",
        "score": 2,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/24/2020, 15:59:50",
        "replyContent": "Hi John,\nThanks for your feedback. We will be adding ports of entry in the next version of the application. Sincere apologies for the inconvenience.",
        "repliedAt": "06/25/2020, 15:26:36"
    },
    {
        "reviewId": "gp:AOqpTOHVCKwHW8wnyZThvkKRBkQTuF2KfBLOEMsXr5Ee9azrwC7s7-xfXrbIsPtmnFc4hkjPUEIb8D-dyDtD5A",
        "userName": "Cass Bar",
        "userImage": "https://lh3.googleusercontent.com/-9zA5j66MpqM/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckufCjlyjMB-M91Kh-w-2-mtp0SPw/photo.jpg",
        "content": "I cant even start mine..... the port of entry isnt even on there....",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/18/2020, 02:54:02",
        "replyContent": "Hi Cass,\nThanks for your feedback. We will be adding ports of entry in the next version of the application. Sincere apologies for the inconvinience.",
        "repliedAt": "06/19/2020, 17:19:55"
    },
    {
        "reviewId": "gp:AOqpTOG13AuConTk8nRdtsqJvb__t3U5coHz0GznnYQeeS_1hvP9DR0Yku-8JjQ51owj437Yqc4Zmj-pYWbKMg",
        "userName": "Alexandru Balasa",
        "userImage": "https://play-lh.googleusercontent.com/-OEnSnJlFnYg/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucl3BKB9xo5Bv_cCHBDNJFGl4MtmIw/photo.jpg",
        "content": "Useless, waste of time. Avoid. The border guard did not hear about it and he had no idea what the \"token\" is. I only had to give my proposed self isolation details to him and that took less time than to input the same thing in the app. Good example of government waste, better use for the money spent would have been easy to find right now.",
        "score": 1,
        "thumbsUpCount": 37,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/15/2020, 20:10:43",
        "replyContent": "Hi Alexandru, thanks for your feedback. We will continue to follow-up with staff on the ground to ensure tokens are clearly visible to travellers, and border service officers are informed. We will continue to work to ensure the app meets its objective of making the process easier and faster. We apologize for the inconvenience.",
        "repliedAt": "06/17/2020, 11:23:46"
    },
    {
        "reviewId": "gp:AOqpTOGnUV7URsZhVHhJ1TfcngtSrCwdXVtlfcChTolRIQo__36JaNVDg0ka9MLXKXLbU_wC2DKeu-UeRvjlQw",
        "userName": "Josche MacDonnell",
        "userImage": "https://lh3.googleusercontent.com/-8Ae-XWOPdmY/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnsLA3bXOjy-cQorLqaaHHkKpM1zA/photo.jpg",
        "content": "Need token? Already arrived at final destination.. no idea whom to contact now",
        "score": 1,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/10/2020, 02:33:43",
        "replyContent": "Hi, thanks for your feedback. Tokens are currently on display at ports of entry in order for travellers to submit their information. We will continue to follow-up with staff on the ground to ensure this remains visible to travellers. We apologize for the inconvenience.",
        "repliedAt": "06/11/2020, 14:25:50"
    },
    {
        "reviewId": "gp:AOqpTOHfoQO_gobFnLFqqwAFTmKD4MPE30XnvZDXyIzDVyvou9u6a4SIKZ-C1Ljmder6BPFuk8JKZOxGFQk-YA",
        "userName": "Tyson Moore",
        "userImage": "https://lh3.googleusercontent.com/-tNxTRyrRcBI/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnGl2YuPUOYdKTUOoE5V5M0iRlIXA/photo.jpg",
        "content": "Wasn't informed i would need some mythical token at all by the people at the douglas point of entry, I'm already on the island with no real feasible way to go back, how am i supposed to get the token without going all the way back to the border? This process is clearly not very well thought out if people aren't being given necessary information.",
        "score": 1,
        "thumbsUpCount": 2,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/09/2020, 00:05:55",
        "replyContent": "Hi, thanks for your feedback. Tokens are currently on display at ports of entry in order for travellers to submit their information. We will continue to follow-up with staff on the ground to ensure this remains visible to travellers. We apologize for the inconvenience.",
        "repliedAt": "06/11/2020, 14:26:08"
    },
    {
        "reviewId": "gp:AOqpTOFPUnAny-HEmmqPzQtjj_0vgl5HsBuXn18qZXAX_PMcbGWyxT3GseQ3GIzfyzBnJVyssR7h3tLEgfGiFQ",
        "userName": "Barb Rotteveel",
        "userImage": "https://play-lh.googleusercontent.com/-qEnQZCrllE4/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucnX_J2ePfabT2_iQG8S-z1ORDLBVQ/photo.jpg",
        "content": "I can't get into this App as there is no other and my arrival airport from the state after a night coming from Mexico is not on the list.",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "1.4.0",
        "at": "06/03/2020, 20:55:31",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFEcp0fwYtAW_-gm_3tkIfpLA4tpSTkwhglQnW2JWJtlz0qOStXvrFv2A23Fpb5e2FEfzTvaJqAPYZv-Q",
        "userName": "Jeff Cavanagh",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgEZUG6G8qPDsNQ5sgVfNhJmscKqlHcpVZsA3tDbw",
        "content": "I filled it all out except the \"token\" at the end. When I got to the border, the personnel knew nothing about it. There was no posting for a token either.",
        "score": 2,
        "thumbsUpCount": 11,
        "reviewCreatedVersion": "1.4.0",
        "at": "05/30/2020, 20:37:40",
        "replyContent": "Hi, thanks for your feedback. Tokens are currently on display at ports of entry in order for travellers to submit their information. We will continue to follow-up with staff on the ground to ensure this remains visible to travellers. We apologize for the inconvenience.",
        "repliedAt": "06/05/2020, 10:04:28"
    },
    {
        "reviewId": "gp:AOqpTOE3A9EPT_r9HC_XWvJMYE-WLVOaFAa1N6leUkirlLXcJyF_hmY7UAnXm_E3iya09TNgWVBrm0IKld5YlA",
        "userName": "Ly Cheng",
        "userImage": "https://play-lh.googleusercontent.com/-KYj6YduEw04/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuclhk359AdmtfW6snJNHX36Czsw2KA/photo.jpg",
        "content": "Hi, I have a question, where can I get the token number? Is it posted on columns of entry hall,or is it on the screen of the declaration kiosk? So everyone uses same code? Or It's generated after the electrical declaration ?I can't understand how it works",
        "score": 4,
        "thumbsUpCount": 8,
        "reviewCreatedVersion": "1.4.0",
        "at": "05/29/2020, 18:58:35",
        "replyContent": "Hi Li, thanks for your question. Once travellers arrive at a point of entry, there will be posted signage indicated the token number for that specific point of entry. Once entered, the app will generate a summary code for travellers to present to the Border Services Officer.",
        "repliedAt": "06/03/2020, 17:11:41"
    },
    {
        "reviewId": "gp:AOqpTOGj1NKICUXSLoeBpRYwtPFd6DMQg2IB0slHWhEqCy-FM2DQCMe0igmzMAA44yeWbO9BDwWeMJJA9QJCEA",
        "userName": "Paula Cardoso",
        "userImage": "https://play-lh.googleusercontent.com/-nKpStxGooxk/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucm1C28bwFrzMh9p_4hIaaq9f2CBTA/photo.jpg",
        "content": "Where can I download the paper form, the app is not working in my phone",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": null,
        "at": "05/26/2020, 17:32:25",
        "replyContent": "Hi Paula, we apologize for the difficulties you experienced. In the event that the app is not functioning on your device, alternative options are available at ports of entry.",
        "repliedAt": "06/03/2020, 17:07:10"
    },
    {
        "reviewId": "gp:AOqpTOEcpoE271VNUmSxxKA7nbJs8cQVmQmiG6eUBPVeamg1PD4mGuytiGCCqSTqsAlZxsj5E3UGzlgZB-PHaw",
        "userName": "Andy Wang",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiwtWznXRlHcfbZk51gCb1WfYJEidp6jcU4ibC15w",
        "content": "Assisting my parent with this form coming back from Taiwan. Very confusing as it will not allow you to proceed if you do not enter departure date. There IS no departure date if she's coming home, who the hell thought of this form?",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": "1.3.3",
        "at": "05/24/2020, 10:56:11",
        "replyContent": "Thanks for your feedback, Andy. The departure date refers to the date a traveller is leaving the country of origin. The arrival date refers to the date a traveller enters Canada.",
        "repliedAt": "06/03/2020, 17:04:04"
    },
    {
        "reviewId": "gp:AOqpTOHwvlsWcuTpke1Ga-eUm5fCqVJ4fJTbejy-UrlanFat_gP1fNkcWFgW3nOxBq1_s-X1YX_gyYzuvhGZhg",
        "userName": "Wei Sing Lyn",
        "userImage": "https://lh3.googleusercontent.com/-njvqzDfO_NU/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucl9KeTVSl3nX-1zh2DurD3OZnCflw/photo.jpg",
        "content": "filled in form at Vancouver Airport upon arrive but nobody informed me who to give it too. so now trying to register with app but can't select the date of arrival as can only select yesterday's date only. can you fix so I can register",
        "score": 1,
        "thumbsUpCount": 11,
        "reviewCreatedVersion": "1.2.0",
        "at": "05/20/2020, 17:31:58",
        "replyContent": "Hi, Wei. Thank you for your feedback. Once you've completed the mandatory information and the token number (available at the port of entry), the app will generate a reference number to be presented to the Border Service Agent at the border.",
        "repliedAt": "06/19/2020, 17:17:55"
    },
    {
        "reviewId": "gp:AOqpTOHI57NTFGvNr5Zry1SlKaE8ouWJcceDyi6VSyWCbvLbcNhC8JL8jdFYF9zyXlSFuvsZyS_48CBgm_YQdQ",
        "userName": "Ania J",
        "userImage": "https://play-lh.googleusercontent.com/-x2-towBLqbo/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucn6jpvKOxDBIVD3WFywLxNwmdWdow/photo.jpg",
        "content": "I am flying back to Toronto today and was told to download this App...not possible...gets stuck on Waiting for Downloading",
        "score": 1,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": null,
        "at": "05/19/2020, 04:22:31",
        "replyContent": "Hi, Ania. Thanks for your feedback. We would encourage you to use WiFi when downloading the app. In the event that the app is not functioning on your device, alternative options are available at ports of entry.",
        "repliedAt": "06/03/2020, 16:54:20"
    },
    {
        "reviewId": "gp:AOqpTOFlnjMKaTeZxVcxP8_YV4nsqXp96IblOF_2Rmk9xF2lsKrK7dJVmjx1YDsI8aJKWgDsMzXA7MBjBjVTMw",
        "userName": "Peter Kennedy",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgKytcxAPMm8pwP48J036av2NjWPLGs6owfTt0cGA",
        "content": "Coming through Montreal from Paris May 16. Info handed out in Paris. Nobody in Montreal seemed to know anything about it. Usual Gov't roll out glitches where right hand utterly unconcious of left hand. No token available at either Montreal or Toronto or finally Winnipeg to complete registration.",
        "score": 1,
        "thumbsUpCount": 15,
        "reviewCreatedVersion": "1.2.0",
        "at": "05/18/2020, 01:43:46",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOF-pjMLm-QCM40t_RyH-AThwFKs9BbKJAhp7Ek1zQLVbos9rJtTSekxIUxEoRR761HWf3S__f314G5udg",
        "userName": "Sandra Boudreau",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GiujeIgIhDe9jOEQtwPCW0tE9hnzd__2hh01Da-",
        "content": "I wasn't aware that I needed to download and complete the form via this app until I arrived at the border. I was told to go fill it in after-the-fact but I was not told I needed a token number to complete the form. There are no options to proceed and no information about who to contact in the app. It would be good to have contact information for support listed more prominently in the app as getting closer to someone who can help has now taken me 6 separate phone calls. Now on hold...",
        "score": 3,
        "thumbsUpCount": 27,
        "reviewCreatedVersion": "1.2.0",
        "at": "05/16/2020, 15:53:43",
        "replyContent": "We apologize for the difficulties you experienced while using the app. Token numbers are posted at the ports of entry. In the event that the app is not functioning on your device, alternative options are available at ports of entry.",
        "repliedAt": "06/03/2020, 16:47:21"
    },
    {
        "reviewId": "gp:AOqpTOFtn4kRRc_zvloKA1TS9HpsaVJz36W6b-DTiq9_em_QYVf0gZOLPhNWuDOyR8rp5JpdZqzyoIcwAiMvRA",
        "userName": "Eric Robberts",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GihQOmAMmGm5DSXs6zsGziVKePRDPOdMJ8GZgiV4u0",
        "content": "It is only possible to enter 3 dates, yesterday, today and tomorrow. It has been like that since I downloaded the app. These are the only dates available.",
        "score": 2,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "1.1.2",
        "at": "05/11/2020, 19:44:50",
        "replyContent": "Hi Eric, the app should allow you to enter the date of your arrival. We will look into this issue further. Thank you for your feedback.",
        "repliedAt": "05/11/2020, 11:31:27"
    },
    {
        "reviewId": "gp:AOqpTOEzRj3Y_7Ho8jTH_-sVzDyTgxDuxgbhOmTdIoIrw4RmV2Ts7oSV_UqkPeucjWT4mBtZv0yzuJoWoGrQew",
        "userName": "Ian Xue",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjuIj4j5YJxmgMyFBT5XTLffTx7f5MzuHnbt2DcVxE",
        "content": "Need your help here. Sorry the one star is for your attention. I am arriving YVR via Sishuan Airlines. However, there is no Sichuan Airlines in the airline options. so I cannot finish it before entering Canada. Please help me out",
        "score": 4,
        "thumbsUpCount": 0,
        "reviewCreatedVersion": "1.1.2",
        "at": "05/09/2020, 17:56:34",
        "replyContent": "Hello Ian, We are sorry that you experienced this. If you choose \"Other\" as the option from the Airline drop down you will be presented with an entry field where you can enter the name of the airline. This is available in the version you are using. Please reach out to us again if you continue to have problems and thank you for using this app.",
        "repliedAt": "05/08/2020, 09:33:27"
    },
    {
        "reviewId": "gp:AOqpTOF3H2PpV8xd69zgbdkRG1fIxQU6cBdnxEi_V7guYZ30_au9NiPnMYRHfxuXIpU7BkeScrx5U2hfSz3QUw",
        "userName": "Adam Mattinson",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GgNHzMF4J2N8GGR3nf8-W57z-AojULsKOZVjvKCpw",
        "content": "We weren't able to use this app on android or iPhone. Spent hours on hold with CBSA and Public health, with both saying the other is responsible for the app. In the end, border services said the system was down and they would call us back, but they never did",
        "score": 1,
        "thumbsUpCount": 10,
        "reviewCreatedVersion": "1.0.35",
        "at": "05/06/2020, 14:12:43",
        "replyContent": "Hello, thanks for your feedback. ArriveCAN is currently available on both iOS and Android devices. In the event that the app is not functioning on your device, alternative options are available at ports of entry. All inquiries or trouble shooting should be directed to phac.canarrive.aspc@canada.ca to reach the team directly.",
        "repliedAt": "05/08/2020, 10:03:04"
    },
    {
        "reviewId": "gp:AOqpTOHLZQ0fnsIhtydzv6D0uOL0eTGuIsa7KrA53UYn3Asl6jnkP2izmmUhmYfWJdzwPCmKc-xVSzHgRUZgJw",
        "userName": "A Google user",
        "userImage": "https://play-lh.googleusercontent.com/EGemoI2NTXmTsBVtJqk8jxF9rh8ApRWfsIMQSt2uE4OcpQqbFu7f7NbTK05lx80nuSijCz7sc3a277R67g",
        "content": "Very user friendly!",
        "score": 5,
        "thumbsUpCount": 1,
        "reviewCreatedVersion": null,
        "at": "05/04/2020, 08:15:46",
        "replyContent": null,
        "repliedAt": null
    },
    {
        "reviewId": "gp:AOqpTOFPGCUxOSADI0Mp9vXva6pFLSlLc9uemrO0ZNRQADfzA4NqojQoNx-u0eUdaVC57wzyg0UV2yck2O-93g",
        "userName": "abdelbasset chaabane",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GhCH0MxM-vXu4LrNC9l0p2Z-JNMQO3z_dhQPFFj",
        "content": "Got to the step is asks for token number after answering all questions . Where can I get this token number where I am supposed to get this done before travelling ?",
        "score": 5,
        "thumbsUpCount": 4,
        "reviewCreatedVersion": "1.0.35",
        "at": "05/04/2020, 00:54:30",
        "replyContent": "Hi, thanks for your feedback. Token numbers are not available in advance. Token numbers are available and displayed at the Ports of Entry. After you've filled out your information, return to the app once you've arrived, and enter the token provided to you at the Port of Entry.",
        "repliedAt": "05/04/2020, 12:08:01"
    },
    {
        "reviewId": "gp:AOqpTOGxNYxykybXS1t5irNl5laA_R5H8nFUzA6q60bV8u9NcmkSaIW4-u_12O8hm90sho3WqGXS0Doybxehmw",
        "userName": "Nate V",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gif_GdjcQotuOU3vUDDZTpIBQXuzN5M_fNO4L8NBg",
        "content": "wants only digits for postal code no alpha characters",
        "score": 1,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "1.0.35",
        "at": "04/30/2020, 18:47:18",
        "replyContent": "Hi, thanks for your feedback. Alpha characters are accepted in this data entry point - the error may result by trying to include a space in the field. We recently deployed an update on April 29; please also ensure the newest version is installed.",
        "repliedAt": "04/30/2020, 20:57:58"
    },
    {
        "reviewId": "gp:AOqpTOHhBYGbvOVBOZt6JMnL6olPZqo_942fGUko-GAMhZTD6-YJp8x8FJD_fWf64iRwwlKI13wvBr1GhHaDFg",
        "userName": "Ev Mckay",
        "userImage": "https://play-lh.googleusercontent.com/--b3eVZXpXro/AAAAAAAAAAI/AAAAAAAAAAA/AMZuucn9gdgBCVCAXsCzNthYDWq3gNeEiQ/photo.jpg",
        "content": "What a useless app and waste if time. I thought I be a responsible citizen returning home and downloaded this app from a link on the government page. Westjet is only doing repatriation flights to Toronto yet the app won't select that airport. How frickin stupid can that be?",
        "score": 1,
        "thumbsUpCount": 13,
        "reviewCreatedVersion": "1.0.31",
        "at": "04/28/2020, 18:15:53",
        "replyContent": "The ArriveCAN mobile app is currently being piloted at two Canadian ports of entry - Douglas border crossing and the Vancouver airport - for this reason, other locations were not yet advertised. Other locations will go live shortly. Until then, other options will be available at the border in order to submit the Traveller Contact Information form.",
        "repliedAt": "04/28/2020, 20:01:41"
    },
    {
        "reviewId": "gp:AOqpTOG2xKIjRvf6NcrLYwnLOXwH8kkVTRdeFAMHaDapa875Ksfc6GhNTNguQQw8xSiUQFlZmX0yHPcPPjqhVQ",
        "userName": "Adriaan de Hoog",
        "userImage": "https://play-lh.googleusercontent.com/-TrMp1SJN63g/AAAAAAAAAAI/AAAAAAAAAAA/AMZuuckIePnGthlA_dvRYrn_ij5pQoYIPA/photo.jpg",
        "content": "What a useless time wasting app",
        "score": 1,
        "thumbsUpCount": 3,
        "reviewCreatedVersion": "1.0.31",
        "at": "04/28/2020, 17:04:14",
        "replyContent": "The ArriveCAN mobile app is currently being piloted at the Vancouver airport and Douglas border crossing and will be made available across Canada shortly. The app is intended to help incoming travelers enter information before their arrival in order to reduce wait times and points of contact at the border.",
        "repliedAt": "04/28/2020, 17:42:21"
    },
    {
        "reviewId": "gp:AOqpTOHlfwuNcSPxmQUWSxfRRWwPKqLznpuMSuwmZTDjIazprHHbC5ez2KuWF06llHShRpFu5acuNJ4Rban_YA",
        "userName": "Brian Croft",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjZNMDPb3t4M5jU_n9juYenf0jJIrOkEBrUMcDiQg",
        "content": "It doesn't bring up any land border crossings except one...Douglas Passenger? Waste of time. The travel information says to use this or a \"form\" but no link to print the form. So what now...wait for an officer at the booth to hand it to you and then sit there filling it out? Please update the app.",
        "score": 1,
        "thumbsUpCount": 5,
        "reviewCreatedVersion": "1.0.31",
        "at": "04/28/2020, 12:41:03",
        "replyContent": "The ArriveCAN mobile app is currently being piloted at two Canadian ports of entry - Douglas border crossing and the Vancouver airport. Other locations will go live shortly. Until then, other options will be available at the border in order to submit the Traveller Contact Information form.",
        "repliedAt": "04/28/2020, 12:59:16"
    },
    {
        "reviewId": "gp:AOqpTOHIZHUg3tyiQ8g5gN4yJAly2vQHv0CV_S-39EmizacV90rG02pU9MA22cfHAeHCiOiZIOmXUyyoXzu0YQ",
        "userName": "Basil Papademos",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14Gi-8LPduXDLpwovj8XT8I-S-dc0ZFZ2aKkTi72u5g",
        "content": "Not working properly. I am coming in to Toronto airport but the app keeps defaulting to Vancouver airport. I installed and reinstalled a few times but same problem. I type in Toronto airport, Pearson, then click on next and nothing happens. I have an Android phone and it has more than enough room for the app.",
        "score": 1,
        "thumbsUpCount": 18,
        "reviewCreatedVersion": "1.0.31",
        "at": "04/27/2020, 23:26:15",
        "replyContent": "The ArriveCAN mobile app is currently being piloted at two Canadian ports of entry - Douglas border crossing and the Vancouver airport. Other locations will go live shortly. Until then, other options will be available at the border in order to submit the Traveller Contact Information form.",
        "repliedAt": "04/28/2020, 08:48:08"
    },
    {
        "reviewId": "gp:AOqpTOGXieFbUOw-ExgtBJ-5ufv9C5rubLhWmNziChE89SZ3caCvhbDVfEDuDrWDRVZRXg3CJpsLJGRspnclFQ",
        "userName": "FLY CANUK",
        "userImage": "https://lh3.googleusercontent.com/a-/AOh14GjFrK5TD6ghnt-hjNRZ9lt7IVx-dqhcYQtb8VvH",
        "content": "Doesnt work. Wont let me select my port of entry, only lists douglas passenger",
        "score": 1,
        "thumbsUpCount": 6,
        "reviewCreatedVersion": "1.0.29",
        "at": "04/27/2020, 11:42:03",
        "replyContent": "Hello, thank you for your feedback. The ArriveCAN mobile app is currently being piloted at two Canadian ports of entry - Douglas border crossing and Vancouver airport. Other locations will go live shortly. Until then, other options will be available at the border.",
        "repliedAt": "04/27/2020, 16:24:37"
    }
]